{"user_review":{"0":{"post_title":"Google announces early August 13 event for Pixel 9 and Pixel Watch 3","self_text":""},"1":{"post_title":"Pixel Watch 3 review: Google finally got it right, especially with the battery life","self_text":""},"2":{"post_title":"Pixel Watch 3 leak reveals 24 hours of battery life","self_text":""},"3":{"post_title":"Pixel 9 lineup still uses UFS 3.1","self_text":"source: me, ran CPDT benchmark Pixel 9 Pro\/XL: https:\/\/imgur.com\/a\/AfEmmp3Galaxy Z Flip6: https:\/\/imgur.com\/a\/lqpH3gB256GB on both."},"4":{"post_title":"Google Pixel now makes up 3% of phones shipped in North America","self_text":"That’s up from 1% back in 2021. Also, Google’s Pixel kept around 3% share across major US carriers. Via: [https:\/\/9to5google.com\/2024\/02\/29\/googel-pixel-q4-2023-north-america-marketshare\/](https:\/\/9to5google.com\/2024\/02\/29\/googel-pixel-q4-2023-north-america-marketshare\/)Source: https:\/\/www.counterpointresearch.com\/insights\/infographic-q4-2023-smartphones-mobile-market-monitor\/"},"5":{"post_title":"Exclusive: Google Cancels Pixel Tablet 3 Development","self_text":""},"6":{"post_title":"Pixel Watch 3 specs leak: Same chip, RAM, and storage, 1-60Hz refresh rate","self_text":""},"7":{"post_title":"Loss of Pulse Detection on Pixel Watch 3 receives FDA clearance","self_text":""},"8":{"post_title":"Sources: Pixel Watch 3 will have 45mm size, Pixel Buds Pro 2 also coming","self_text":""},"9":{"post_title":"Pixel watch 3 pricing: up to $500","self_text":"* Leaked pricing suggests the Pixel Watch 3 will start at $349 for WiFi and $449 for the LTE model.* The larger Pixel Watch 3 XL is expected to be priced at $399 for WiFi and $499 for LTE.* While the WiFi-only Pixel Watch 3 maintains the same price as its predecessor, the LTE model sees a $50 increase.https:\/\/www.androidauthority.com\/pixel-watch-3-price-leak-3467128\/"},"10":{"post_title":"My honest pixel 9 pro review after almost 4 months","self_text":"I picked up a obsidian 9 pro (256 GB) from my carrier that was $800 off as part of my phone plan (only had to pay \\~300 out of pocket). I previously had the pixel 7 for about a year and a half, and before that the iPhone 12 (will never be returning to fruit company ever again).In my opinion, the 9 pro is better than the 7 in almost every way possible. Otherwise, I would have waited until the 10 to upgrade. Currently I will probably upgrade when the 12 or 13 releases, as I see no reason to upgrade until then and it will give google more time to iron out some of their \\*quirks\\*.  I love the smaller 9 pro and the form factor is much better than the 7 (although I hope they make the aspect ratio more like samsung or iphone in the future).The Screen: the screen is absolutely amazing. Colours are very vibrant and rich and the 3000 nits peak brightness is very handy for outdoor viewing. The 120 hz refresh rate is a nice upgrade from the 90 of my 7, especially being LTPO.Battery life: the battery is fantastic on this phone FOR MY USE!! I use my phone for an average of 2 to 3 hours a day and will regularly end the day with 40 to 50 percent. No real complaints here. I have pushed it a couple of times on days where I used it more and was around 7 hours of SOT with about 15-20 % remaining.Cameras: The camera on this phone is great and I personally love the pixel look. The telephoto lens along with the upgraded sensors is a nice upgrade from my 7. The only thing I wish they would change is the lens lag you get when switching between them. Other than that, again fantastic cameras. My friend has an iPhone 15 pro and he thought even the 7 took better photos than his phone, much less the 9 pro.Performance: I know this one is kinda iffy especially for a 1000 dollars phone, but I definitely notice an upgrade from my 7. Obviously, it isnt on par with the latest from samsung or apply, but for everyday sue, it is great and you wont be able to notice a difference. I almost never game and if I do they are smaller, not as demanding games, so for my use the performance is perfect! The main area you can tell the difference in is gaming, and also apps opening (google please add UFS 4.0 storage in the 10 series).Thanks for listening to my rant :)Edits:The modem: the modem is much much better than my 7. I have never had a single time where I have had cell reception issues or anything of the like in the 4 months! My drive back to school has a good 20 or 30 minutes stretch that is in the middle of nowhere and my 7 would sometimes struggle there, my 9 pro never has!Bio-metrics: The fingerprint reader is MUCH better, like not even close. The face unlock is also very nice and snappy, but doesn't work well in the dark."},"11":{"post_title":"Exclusive: This is the Google Pixel 9 Pro in All 4 Colors","self_text":""},"12":{"post_title":"What 3 to 4 features do you think Google must focus on Android 16?","self_text":"Fellows, I have been enjoying my Pixel 8a for around a month, but I still think there are a couple of features that Google should improve. In my case, if I were the Product Owner, I'd like to try to focus on three topics:1. **Complete the freefloating form feature.** I have tested it, and for me, it was something I actually missed from my old Oppo A91. It seems almost ready, but I cannot overlap apps in my phone. Maybe it's a bug, but I would rather this than the Bubbles for all.2. **Improve the video camera.** I went to Sweden to see the Northern Lights and the [results](https:\/\/www.instagram.com\/p\/DD6kIEPtQEj\/?img_index=1) were better than I expected. However, the videos were terrible. I could barely see anything.3. **Allow double-tap to lock.** Several phones have it including my old Huawei.I have also some nice to have:* Bring back the tiles for Data and WiFi or at least, give us the developers the right to the dirty job. I know it's controversial, but I'd like to have them.* Allow the phone to be scheduled when to turn it on or off. My old Oppo has it.* Allow the Alarm to turn on the phone if it's off. My old Oppo has it.* Allow swiping actions like the three fingers for taking screenshots. My old Oppo has it.Maybe you have other ideas or agree with mine. I prefer to focus on specific features that, if we're lucky, the Android\/Pixel product owner might hear us out about before they dive deeper into development of things that we might not like or agree with their \"research\". Plus, if we just rely on sending feedback through the app, I find it often ends up on deaf ears.Have amazing holidays."},"13":{"post_title":"Who is still using their Pixel 4\/XL in 2024?","self_text":"I am. Absolutely still loving using it. I've been using it for 4 years now. Love the face unlock, haptics, display and speakers. Also, love the design in panda white. It just looks lovely 😍 Anyone else still using it?"},"14":{"post_title":"I REALLY wish Google starts using UFS 4.0 instead of UFS 3.1","self_text":"The read-write speeds are so slow. This alone makes all the apps feel slower and less-responsive. Try editing a photo on Lightroom and export it or try uploading a story on Instagram quickly. My god the entire phone slows down so bad.  Just a quick rant. Out I go.Edit: copium is hard in this sub, as always. the same apps I mentioned work so much smoother on Samsungs, Nothings and OnePlus phones. Keep coping fellas. God bless. "},"15":{"post_title":"All Pixel 9 Pro upgrades over Pixel 9","self_text":"Below is the list of all the upgrades you get in the pro phone -1. 1mm extra screen size (insignificant)2. Slightly thinner bezels (insignificant)3. LTPO display (1Hz minimum) (better standby battery life, especially with AOD)4. Slightly Higher Display Resolution5. Higher HDR and peak brightness levels (better outside visibility)6. Vapour Chamber (better thermals and lesser throttling)7. ~~4GB~~ 1.4 GB extra RAM (better multitasking) (2.6GB RAM is reserved for AI tasks, regardless if you use it or not) [*moreinfo*](https:\/\/www.androidauthority.com\/tested-pixel-9-pro-ai-ram-3472624\/)8. Telephoto Camera (48MP) (5x zoom)   1. 8K 30FPS video (artificially upscaled to 8K)   2. Super Res Zoom Video9. 42MP selfie camera (wider)10. Pro controls in Google Camera (software locked by Google)11. Matte back glass + Polished rails12. 1 Year Free Google One subscription (with 2TB storage + Gemini Advanced) (only for purchases before 31st Oct 2024)13. Ultrawideband Support14. ThermometerAll the differences are lised in a single place to help make a more informed purchase decision(do list any differences that I might've missed and I'll add it in the list)"},"16":{"post_title":"Any Pixel 4\/XL users still out there?","self_text":"I still daily drive a standard P4 (have since 2021) and love almost every bit of it. The camera remains great; Motion Sense for sensing when I'm nearby and silencing calls\/alarms remains an excellent quality of life feature that just makes the device feel nice to use; and with a recent battery replacement it lasts as long as I need it to. The only knock is the lack of software support, but with custom ROMs this problem is somewhat resolved. Fellow P4 holdouts, what do you think? Do you feel the need to upgrade or do you feel the phone still fulfills all your needs, as I do? Curious to hear your thoughts. "},"17":{"post_title":"I've had Samsung phones since the beginning, but was excited to switch to a Pixel 9 and see what Google had to offer. I've had 4 weeks of solid regret. Can anyone suggest how to:","self_text":"1)  Move photos from folder to folder.2) Delete a photo from one folder, and leave it in another3) Have predictive text without it throwing in random emojis so that I can type sunny, not 🌞 nay Ng, or thinking instead of 💬 Ng. It turns correct spellings into letter salads.4) Open the phone app to the keypad? If I want Contacts, I'll open Contacts. If I need to use the phone I want a keypad.5) Reset the timer. The Samsung timer will alert on the lock screen, and you can turn it off or reset it. I schedule in 15 min increments. I have to turn off timer, unlock phone, open timer, make another 15 min timer - and chances are I have to clean my hands before I do.I was told it would be easy to transfer everything from my old phone to my new one. Samsung made it almost seamless. Google transferred only Google based data, and a month later I'm still trying to recover all my data and apps. It has been beyond frustrating!"},"18":{"post_title":"planning to buy pixel 4 xl are there any common issues with it?","self_text":"i found one which i think it’s reasonable price even tho he replaced the battery is there anything to be aware of before buying it? im new to google phones never had one before also not using it as main phone and heard that its easy to do root and bootloader etc.. thank you in advance :)"},"19":{"post_title":"Enabled 80% charge limit on Pixel 9 Pro XL (Beta 4) but can't disable","self_text":"This morning when I put my Pixel 9 Pro XL on charge (running the latest Beta 4 update), a pop-up appeared to enable the 80% limit which I'd read was forthcoming, so I applied, and a protection shield appears on the battery icon in the taskbar.  So far so good.  If I want to fully charge my Pixel, how can I disable this option as the 80% charge limit is nowhere to be found, under battery settings, adaptive charging, adaptive battery, nowhere! So now it's stuck with an 80% charge limit - any thoughts?"},"20":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"21":{"post_title":"Google has acknowledged the Pixel 6, 6 Pro, 6a factory reset bug that results in a brick","self_text":"# Update 7\/19\/24Google's team has identified a solution for people experiencing issues after factory resetting your Pixel 6, 6 Pro, or 6a. They are urging affected users to contact [support](https:\/\/support.google.com\/pixelphone\/gethelp) for additional support. Check the [offical thread](https:\/\/support.google.com\/pixelphone\/thread\/283220215) for more details.Edit: I have launched a [survey](https:\/\/www.reddit.com\/r\/GooglePixel\/comments\/1e9jxeg\/survey_pixel_6_series_bricked_after_factory_reset\/) here on reddit about your service centre experience. Please give it a visit and share your experience.# OriginalThe Google Pixel Support Team has identified the root cause of the issue and is working on developing the best possible solution. Check out this thread..[Issues after Factory Resetting Pixel 6 Devices](https:\/\/support.google.com\/pixelphone\/thread\/283220215)# If you have a working phone* Leave your device powered on and idle for **15 minutes** after it has rebooted following a system update. Factory reset **only after that.*** Or Factory reset **before** taking the latest system update.# If you have a bricked phone* Follow the above mentioned thread for more updates from the Google Pixel Support Team* Click on 'I have the same quesion' button to indicate you are facing the same issue# If you are on Android 15 beta* Please \"star\" and \"+1\" these issues on Android Beta Issue Tracker* [Pixel 6 cannot turn on after factory reset](https:\/\/issuetracker.google.com\/issues\/344963939)* [pixel 6 bricked](https:\/\/issuetracker.google.com\/issues\/349860641)Lastly, I'd like to thank you all very much for the overwhelmingly positive response on my [compilation thread](https:\/\/www.reddit.com\/r\/GooglePixel\/comments\/1drgmvx\/another_pixel_6a_mine_bootloopbricked_from\/). Many thanks to [The Verge](https:\/\/www.theverge.com\/2024\/7\/1\/24190024\/google-pixel-6-factory-reset-bricking-phones), [9to5Google](https:\/\/9to5google.com\/2024\/07\/01\/pixel-6-reset-bricking-reports\/), [Android Authority](https:\/\/www.androidauthority.com\/pixel-6-series-factory-reset-brick-3456346\/), [Android Central](https:\/\/www.androidcentral.com\/phones\/google-pixel-6-factory-reset-might-zap-your-phone), [Android Police](https:\/\/www.androidpolice.com\/pixel-6-factory-reset-brick\/), [droidlife](https:\/\/www.droid-life.com\/2024\/07\/01\/dont-factory-reset-your-pixel-6-it-may-brick\/) and many other tech news outlets for covering the issue.This is what a healthy, positive community looks like!Edit: [I fixed my factory reset bricked 6a](https:\/\/www.reddit.com\/r\/GooglePixel\/comments\/1dvjkey\/service_centre_tried_to_trick_me_into_paying_for\/) (OEM unlocking off and bootloader locked). It was at the service centre. They wanted me to pay for a motherboard replacement. I rejected and Google sent it back to me un-repaied. It wasn't booting, but the **bootloader was** **unlocked.** I used the Android Flash Tool to flash Android 14 and it booted. They can unlock the bootloader and unbrick your phone. They just don't want to do it.Edit 2: A lot of people are wondering whether it's safe to update to the latest patch. I do not know about updating, but as stated above I directly flashed the July patch and my 6a is working fantastic. You should be fine as long as you follow the instructions."},"22":{"post_title":"After 6 years of Pixel, ready to quit","self_text":"I've been using Pixel phones for 6 years now and the experience has been great, but lately I've had so many problems I've ready to make the jump to Apple because Google can't stop breaking things.  Currently have a Pixel 6a and recently experienced the following problems:* Wifi continuously disconnects on my home network (two Google Wifi pucks).  This just started in February after a phone update, nothing else changed.  Same internet, same wifi.  So Google broke this obviously and it's impossible to get help.  My family owns iPhones, and two Pixel users (Pixel 7) who aren't experiencing this.  My wifi works great on every wifi network but my home network.* When I make a phone call and need to hit \"1\" for a menu option, it doesn't work.  Call on my wife's iPhone, works fine.  Give me a break...* The Youtube app starts flaking after some amount of time, no pause button and the video is dark.  I have to kill the app to fix it, and then a while later it starts flaking again.With today's tech it seems everything that is working perfectly well is at risk of breaking with the next update.  If Apple gets it right and their product just works when I need it to work, then I'll make the switch.  I've been very happy up until now with Pixel phones, but there's no excuse to continually break simple stuff with each update, they can do better than that."},"23":{"post_title":"Pixel 6 bricked after enabling private space feature in Android 15","self_text":"Just giving a PSA to anyone who has a pixel 6. Don't enable the private space feature if you upgrade to Android 15. I unlocked the private space area, opened an app I installed in it, and it bricked my Pixel 6. I can't turn the phone on or reboot it using the methods provided by Google. It's completely dead.I'm not sure if I was just unlucky or if this is a wider spread issue with Pixel 6 devices, but I'm now going to have to buy a brand new Pixel as the phone is basically a paper weight now."},"24":{"post_title":"June Feature Drop: Pixel 8 Display Port mirroring, 6\/7 Pro Manual Lens Selection, PW2 Car Crash Detection","self_text":""},"25":{"post_title":"Husband just got a strange ‘spoken’ message on his Google Pixel 6?!?","self_text":"UPDATE: I’m overwhelmed by so many great responses\/empathetic stories - thank you all so much ❣️ Please read my ETA’s for answers to questions several have asked…=========================So, a few minutes ago (~10:30pm Central time), my husband was asleep - and his phone, as usual, was in Sleep mode with Do Not Disturb automatically turned on - when he was woken from a sound sleep with his phone speaking some kind of message about Trump (he wasn’t sure - he was just asleep! - if it was a pro or anti-Trump message).  He then checked his phone and there was NO open app or recent notification.Before anyone asks if “he was dreaming”, he walked out to the living room to tell me about it and I could hear his phone from the bedroom speaking some OTHER message (we couldn’t hear it from there exactly what the message said).Not sure if it’s connected, but his phone recently updated to Android 15.  So, WTF is this !!??!ETA: also, several people has asked, and, no, he doesn’t use Google Assistant…Please see my last ETA about the Assistant history…ETA:  the big puzzle is what could break through DND?  A quick Google shows no apparent log (that I could find) that the DND keeps if it’s interrupted?ETA:  We also have an Echo Spot in the bedroom, but Activity History on the device doesn’t show any activity at the time this happened…?ETA: I’m adding this part to answer several similar questions….I’ve said in several replies (and I’m truly sorry that I haven’t more promptly replied to all the 160+ comments which my question prompted, and I thank all of you for each one!) that we both do not Intentionally use Google Assistant.    Since we don’t intentionally use it, I wouldn’t have known until someone suggested to look at Google Assistant history.  So, after researching how to do that, I just now searched his Google Assistant history —- and it does not show ANY activity at all last night - Oct 28 - at around 10:30 pm.   There is an entry that only said “Used Assistant” on Oct 27 at 6:10pm.  There is also an entry for today - Oct 29 -  saying the same “Used Assistant” at 12:14pm.  No other details other than that.  However, there is no entry for Oct 28 at all, let alone for 10:30 pm.  Since we don’t intentionally use Google Assistant (by intentional, I mean by saying Hey Google), I was surprised to see ANYthing in the history.  But those are the entries I found, and (even though I don’t know what triggered those entries) I have no idea what “Used Assistant” without any further details even means, but I don’t believe it indicates that Google Assistant was the culprit.Hopefully this might encourage people to stop downvoting me?  Because I really don’t understand why the downvotes.  But, this is Reddit, so I accept that happens.  "},"26":{"post_title":"My Pixel 6 is dead after Android 15 update","self_text":"I updated my Pixel 6 to Android 15 a few days ago. This morning I'm looking at some press articles and my phone suddenly shuts down. I can't turn it on or do anything.I see that other Pixel 6 users are in a similar situation after installing Android 15.I don't know what to do since my phone is out of warranty."},"27":{"post_title":"Pixel 6 Pro's modem was TRASH! 🗑️ Upgraded to Pixel 9 Pro XL and holy moly, what a difference! 🚀 ","self_text":"I had the Pixel 6 Pro for a while and thought the service was the problem. Upgraded to the Pixel 9 Pro XL and wow, was I wrong! The 6 Pro's modem was terrible.One spot I frequent to work on my laptop is  underground. My 6 Pro had no service there. With the 9 Pro XL, I'm chilling on 5G with a hotspot to my laptop. No issues at all.So glad I didn't switch carriers. Got my unlocked 9 Pro XL at Best Buy with a 6 Pro trade-in.This is the biggest improvement I've noticed. Didn't realize how bad the 6 Pro's modem was until now."},"28":{"post_title":"Live Scam Detection in calls rolling out to Pixel 6-9 Phone app","self_text":""},"29":{"post_title":"Pixel 6 and 7 series in 2025","self_text":"I know these two generations of Pixel have had their fair share of issues and have received a lot of criticism over the years and just doesn't seem to be very popular, but is there anyone out there who have been using either of these phones since launch and have had a positive experience with them?I've had my Pixel 7 since launch and it's been a pretty solid phone for me so far. The only thing I don't like sometimes is the fingerprint scanner, but other than that, I haven't had many issues with it performance wise. However, I do plan to upgrade to the Pixel 10 series later this year. I want to go with the XL model this time around. "},"30":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"31":{"post_title":"Any Pixel 7 owners heading into 2025 with their phone?","self_text":"How do you find it? Are you still enjoying it? Any plans to upgrade? Thanks!"},"32":{"post_title":"My Google Pixel 7 phone died in front of my eyes, as it updated to Android 15","self_text":"I've been in the Google ecosystem for years now, and have had Gioogle phones since they were called Nexus phones, starting by the Galaxy Nexus, then Nexus 4, and finally Nexus 6p.My current phone was a Google Pixel 7, and I absolutely loved it. Two days ago I woke up to go the washroom, and saw my phone notifying me that it would reboot soon to install Android 15. It was charging, so I figured, no problem, do your thing. I came back from the washroom to find the screen black, but with a backlight still. I thought it was rebooting, so I waited. The backlight eventually went away, and that was it. Since then I've been unable to turn it on at all. No recovery mode, bootloader screen, no \\`adb devices\\`, nothing. It's dead, not a single light or sign of life when I charge it or plug it into a PC.I took it to an authorized repair shop, they opened the phone, tried a new battery, no luck. Apparently the internals of the pixel are not modular at all. There's a battery module, a camera module, and \"everything else\" integrated into the motherboard.I'm devastated. \"New Phone Money\" is not something that comes easy to me these days, and this happening as part of an Android update pushed by google itself feels very wrong. I contacted the support and was told that my phone was out of warranty (I bought it in 2022), and that there's nothing they can do. I found this response infuriating and unfair. If a company is pushing OTA updates, the least it can do is offer a store credit for when these updates brick someone's phone.Anyhow, I don't mean to spread fear, and so far I was only able to find 3 other Pixel 7\/7as that bricked during this update, so it's clearly not widespread enough for google to care I think."},"33":{"post_title":" From Google Pixel 7 pro to Google Pixel 9 pro XL , my thoughts and opinion if anyone is considering switching.","self_text":"I went from a P7Pro to a P9Pro XLAfter using it for 1 week now here are some observations that might help anyone considering switching.1 - DesignI personally love the 9 design, the 7 pro is not bad but I never really liked the classic pixel camera, always looked pretty fugly to me and not really premium looking. So overall im very happy with the new design and I think it is a massive improvement. But design is very personal, some might prefer the 9 look while others might prefer the 7.2 - Battery lifeI noticed a huge difference in battery life, I always had problems with the 7 pro in terms of Battery, it drained fast and also the charging was not really so fast. So far the 9 Pro lasts much longer for me and charges faster so im very very happy with this change.3 - PerformanceP9Pro is better in gaming especially games that are demanding, in terms of tasks and everyday use both phones are very responsive and fast.  One thing I love about the P9Pro is that it doesn't overheat nearly as fast as the P7Pro, I had a few issues with the 7 Pro overheating in certain conditions, so far no issues with the 9 Pro.4 - SignalMassive massive improvement, I am sometimes in some areas where with the P7Pro I had no signal, or extremely bad signal, it was always a problem and I was not sure if it was the phone or my operator, was even considering switching the operator... Currently with the P9Pro not only do I have signal in all those places, 95% of the time its 5G, extremely good signal, no issues, im very happy with this improvement5 - DisplayBoth are nice and good, but P9Pro definitely better with much more nits etc...6 - FeaturesBoth phones have a lot of features but P9Pro has alot of new AI features, it depends if you like that or not, personally i love it and im extremely happy with pixel studio, reimagine and all that... currently the only bad thing is they are both a bit primitive still and limited as you can not do alot of things (humans, characters etc..) but I know it will improve alot. Also the better fingerprint sensor is very welcomed. Overall very happy7 - CameraI was very happy with the P7Pro camera, its not perfect (video, selfies etc) but overall a very nice and strong camera, especially main camera, telephoto etc..I have to say the P9Pro is definitely a good improvement tho.I plan to do a comparison review this weekend or sometime in the next weeks and compare photo by photo to make this review much more detailed, but at the top of my head:-Selfie camera is much better in the P9Pro-Ultrawide is much better-Panorama and night panorama is much better-Low light and Night shots are quite alot better-Video is much better also I notice much less noise-Telephoto camera (to my suprize) is much better, when doing a x15 zoom photo or even more for example, the P9Pro has alot more details-Main camera also seems better overall in the P9Pro, alltho there is no massive improvement, the P7Pro has a very very good main camera.I also like the fact that its more vibrant with the colors, if I had one gripe with my P7Pro camera as much as I loved it (apart from selfie cam and videos needing a bit of an upgrade) it was that I usually had to up the vibrance of all my photos in edit mode, they were just a bit too washed out and not vibrant enough.More accurate review when I do a full review with photos etc..Overall im very happy to switch and I recommend it."},"34":{"post_title":"June Feature Drop: Pixel 8 Display Port mirroring, 6\/7 Pro Manual Lens Selection, PW2 Car Crash Detection","self_text":""},"35":{"post_title":"Pixel 9 significant upgrade over Pixel 7","self_text":"The 9 feels like a legitimate flagship even though it's not the Pro version. Whereas the 7 never felt like a flagship. The build quality is way better while the 7 felt light, plasticy, the 9 feels premium just like the iPhone 14\/15 Pro. The screen is brighter and the fingerprint sensor is by far the biggest improvement. In terms of day to day operation it's smooth and I have no complaints about battery life or heat. Excited for RCS to roll out soon at that point I may never feel envious of iPhone users again.  "},"36":{"post_title":"Google's 7-Year Update Promise, what do you really think?","self_text":"Google's commitment to **7 years of updates** is a big deal, but I wonder if it’s sustainable. Will we actually be getting meaningful updates for that long, or just security patches after year 4?Apple has done **5+ years** consistently, but Android brands haven’t had the best track record. Will the device even stay smooth for that long, or will it be another case of \"updates slowing down older devices\"?"},"37":{"post_title":"Pixel 6 and 7 series in 2025","self_text":"I know these two generations of Pixel have had their fair share of issues and have received a lot of criticism over the years and just doesn't seem to be very popular, but is there anyone out there who have been using either of these phones since launch and have had a positive experience with them?I've had my Pixel 7 since launch and it's been a pretty solid phone for me so far. The only thing I don't like sometimes is the fingerprint scanner, but other than that, I haven't had many issues with it performance wise. However, I do plan to upgrade to the Pixel 10 series later this year. I want to go with the XL model this time around. "},"38":{"post_title":"Pixel 7\/7Pro Owners","self_text":"Hi fellow Pixel 7\/7Pro owners. How is your phone holding up in 2025 so far? I've had my Pixel 7 since launch and it's been very solid for me so far, no issues. I do feel my battery life has dipped a bit but not to where it's a major issue yet. But software and performance wise, it's been a champ. "},"39":{"post_title":"It's unreal how my Pixel 7 takes better pictures than this S24 Ultra","self_text":"is this a thing, or am i missing something. the 100x zoom is cool on the s24 ultra; but i bought this phone primarily for picture and video, and its just awful... everything is over exposed; especially skin tones  "},"40":{"post_title":"My experience with Pixel 9 Pro XL as daily driver for 10 days and why I'm returning it.","self_text":"Hey everyone, I know you're not big fans of negative opinions, but I wanted to share my experience with the Pixel 9 Pro XL after using it for almost 10 days. At first, I was super excited like everyone else. When I got the phone, my initial thought was that it looked amazing. I quickly set it up and was really impressed with the new fingerprint sensor. The phone did get pretty hot during setup, but that's probably normal.I transferred my eSIM from my S24 Ultra and started using the Pixel as my daily driver. Unfortunately, the very next day, I was in for a shock when I went to my local grocery store. I realized the connectivity wasn't much better than my old Pixel 8 Pro. The phone switched to 3G, and the data speed dropped dramatically, making it almost unusable. I quickly checked my wife's iPhone 15 Pro Max, and it still had a perfect connection with great data transfer. Even phone calls were choppy.The next day, I went back to the same shop with my S24 Ultra, and there wasn't any issue. Fast forward a couple of days, and we went on a trip with our kids. My wife and I took lots of pictures - me with the Pixel and her with the iPhone. On the small screens, everything looked fine, but when we reviewed the photos on a computer, oh man, the Pixel's portrait shots were way worse. The edge detection was awful, and the kids' skin looked weirdly smoothed out, like they had makeup on to hide imperfections. The other pictures were okay, maybe comparable to the iPhone's.The final straw that made me decide to return the Pixel was the animation stuttering, especially noticeable during transitions and scrolling. Twitter also acted up, often failing to load pictures and videos. I had to force-close and restart it multiple times a day to get it working properly.Sorry, but it just doesn't feel like a premium phone. Google should either offer a better price or better specs. In my opinion, this phone is worth no more than 600 euros, not 1200. I know I'll probably get a lot of downvotes for this post, but this is my experience and personal view. I really wanted to like the phone and keep it as my daily driver, but it's just not comparable to real flagships at all."},"41":{"post_title":"Poll: Would you buy the Pixel 10 if it had free unlimited photo backups?","self_text":""},"42":{"post_title":"Why i'm saying goodbye to Pixel after almost 10 years 🥹 ","self_text":"Hey Pixel owners!Just wanted to share my experience using Google phones for a decade and also why i decided to give another brand a try for now. **TLDR: I feel like i've been a beta tester for google since the Pixel 6 and upwards.**I've been using google phones since the Nexus 6P and instantly fell in love with them! The camera of the 6P was ahead of it's time, especially the ease of use. My previous phones were Galaxies, and these camera apps always had me take 4 or 5 pics before i snapped the right shot, the 6P just made it into a one hit wonder. I also loved the clean Android feel and seeing Android be improved to what it is today was an amazing journey. Google phones i owned:* Nexus 6P* Pixel* Pixel 2 XL (the panda <3)* Pixel 3* Pixel 4* Pixel 3 (again! I loved the size)* Pixel 6 (..)* Pixel 8 (and pixel watch + buds!)My experience with Pixel phones has been outstanding, especially in the beginning. I was a BIG advocate of using Pixels and shilled them a lot. They were a bit hard to come by in Holland at first, so i'd import them. Such great phones though! I bought a Pixel 4 for my Mom that still works to this day! No lag, just smooth as butter. I also loved the google ecosystem and the design language. I still do. I think android has really matured and is in so many ways pushing the envelope in smartphone OS development. I'm trying a *different brand* now but i do miss a lot of the features that android offers. It's so smooth, and navigating the phone is superb. Universal back gesture, now playing, flip to DnD, flick your wrist to reverse to selfie cam; So many nifty ways to interact with your phone, i love it!There has been a \"but\" in this story for me, unfortunately. Ever since the Pixel 6, the road has gotten a bit bumpy for me. The 6 had strange issues, would have excessive battery drain, get really hot, and have software bugs like apps hanging. I loved these phones for the stability and this was getting a bit of an issue. Maybe i was just unlucky?I hoped it was a 6 issue, so i upgraded to the regular 8 + pixel watch 2, and this is were it really got crappy for me on the hardware spectrum. The 8 had a few software issues, like apps hanging when multitasking, that i could live with, but the hardware started failing me, while traveling Japan. First, my Pixel Watch 2 just stopped charging and died on me out of the blue, and a month later, my Pixel 8 started getting a weird green screen issue. tens of times a day the screen would just turn green and spaz out for a minute. Very inconvenient when you're on a Japanese train station trying to figure out where to go. Combine that with google maps hanging a lot when in PIP mode, and it was beginning to become an annoyance to use the P8 on the road.Google support's solution was for them to send the phone in for repair, which would mean i would be without a phone for 2-3 weeks, so i was forced to buy a phone in Japan to travel without hassle. I realised i kinda lost faith in the stability of my pixel because of my 6 and 8 experience, so i decided to \"switch sides\". And i feel a bit sad to leave the Pixels behind to be honest. I genuinely love these phones, i've captured many great memories with em, and they've accompanied me on so many great adventures and never let me down. Until recently.Now, having joined the other side still feels weird. It's a gorgeous device to look at, but i don't think *the other brand* has a better operating system, and in lots of ways i miss my pixel's ease of use. Switching was not that difficult, so i will definitely be back in the future, but i really want Google to deliver a more stable hardware experience first.I feel like i've been a beta tester with these last 2 Pixels. To get a support solution that involves not having my phone for 2 weeks is also very unsatisfactory. (And strange, as my watch WAS able to be exchanged,  but the watch is not really something i can't travel without)I feel like with google's ambitions being upscaled they're also upscaling some of the woes these phones have and it's reflecting on the quality of my experiences. I really hope the 9 will be a succes and makes me wanna jump back into the Pixel experience, but i think i'm gonna skip a few generations. It'll be good to fall in love with em again :)Anyway, first world problems, eh?"},"43":{"post_title":"Exclusive: Google picks a MediaTek modem for the Pixel 10 series","self_text":""},"44":{"post_title":"Do you think Google will go big with Pixel 10?","self_text":"Do you think since it will be their 10th iteration of a phone, that they will \"go big\"? Define that as you will. But mostly go over the top with new stuff, or just the normal-ish upgrades? I think it would be cool to see them pull out a lot of big stops for it honestly. * Ultra bright display* Anti reflection * Camera system upgrades as best as possible* UFS 4+* Large battery* New software features (I like that create a gif feature on new samsungs!) * I wish they had Proper Face ID (even tho the rumor is Pixel 11) * Video Boost on device?"},"45":{"post_title":"Exclusive: Huge Pixel 10 and 11 leak reveals Google Tensor is following in the iPhone's footsteps","self_text":""},"46":{"post_title":"What would like like to see on the Pixel 10 series?","self_text":"Personally, I would like:(1) UFS 4.0 or 4.1 storage(2) Minimum 256 GB storage at least on the pro models(3) Keep the smaller pro and make it even smaller if possible (6.2 or even 6.1 inches)(4) New and improved Tensor G5 that improves power, battery life, efficiency, etc(5) Wider aspect ratio"},"47":{"post_title":"Google Pixel 10: First phone case leak provides an early look at the design","self_text":""},"48":{"post_title":"Full Tensor G5 specs reveal big and small changes coming to the Pixel 10","self_text":""},"49":{"post_title":"Are y'all jumping for the incremental changes or waiting for the pixel 10?","self_text":"With the 9 on the horizon, who's gonna get one and who's going to wait for the 10? With talk about the new chip manufacturer I'm going to wait. I bought a pixel 7 as my first Google phone right before the 8 came out. As a long time Galaxy user, I loved the simplicity. I almost never get new phones every year since they're usually incremental improvements at best and blatant money grabs at worst.What do y'all think?"},"50":{"post_title":"What's the point of 12 GB of RAM if the OS still kills apps and tabs when you only have a few open?","self_text":"Seriously. I thought the whole point was to prevent this from happening but it's just as bad now as it was on the Pixel 1. What is the RAM even for?"},"51":{"post_title":"I am buying a used pixel 7 in another 12 hours.What are the things i should check\/look for?","self_text":"Title.Buying a P7 in Srilanka.Any other tips\/advices also will be very much appreciated "},"52":{"post_title":"All Pixel 9 Pro upgrades over Pixel 9","self_text":"Below is the list of all the upgrades you get in the pro phone -1. 1mm extra screen size (insignificant)2. Slightly thinner bezels (insignificant)3. LTPO display (1Hz minimum) (better standby battery life, especially with AOD)4. Slightly Higher Display Resolution5. Higher HDR and peak brightness levels (better outside visibility)6. Vapour Chamber (better thermals and lesser throttling)7. ~~4GB~~ 1.4 GB extra RAM (better multitasking) (2.6GB RAM is reserved for AI tasks, regardless if you use it or not) [*moreinfo*](https:\/\/www.androidauthority.com\/tested-pixel-9-pro-ai-ram-3472624\/)8. Telephoto Camera (48MP) (5x zoom)   1. 8K 30FPS video (artificially upscaled to 8K)   2. Super Res Zoom Video9. 42MP selfie camera (wider)10. Pro controls in Google Camera (software locked by Google)11. Matte back glass + Polished rails12. 1 Year Free Google One subscription (with 2TB storage + Gemini Advanced) (only for purchases before 31st Oct 2024)13. Ultrawideband Support14. ThermometerAll the differences are lised in a single place to help make a more informed purchase decision(do list any differences that I might've missed and I'll add it in the list)"},"53":{"post_title":"Streaming HD video over wifi the Pixel 9 Pro lasts 17:25hrs, Pixel 9 Pro XL 12:24hrs, and Pixel 9 lasts 11:45hrs.","self_text":""},"54":{"post_title":"Pixel 9 for $299 at Mint with 12 month plan ","self_text":"Sharing for anyone else that may be interested because I just bought this myself. It’s the 128 gb version and it says you have to bring your number to Mint. "},"55":{"post_title":"128GB for the Pro models shouldn't even an option in my opinion","self_text":"I think, it should start with 256 at least. Having pro camera modules with RAM of 12\/16GB and just 128GB storage kinda doesn't add up."},"56":{"post_title":"It should be easier to switch between 50 and 12 MP.","self_text":"I find myself using 50mp quite a bit when taking grand landscapes or pictures of things far away. At 10x zoom, the quality of 50mp photos is obviously better than when you leave it at 12, even with whatever weird software junk is going on.Of course, 50mp photos are slower and cause a delay, making things blurry when you're taking anything but a nice still shot. It should be much easier to switch it off so I can grab a quick photo most of the time. I've lost a lot of fast shots just because it's still in 50mp mode and I'd lose the shot completely just in the time it takes to turn the mode off, and then the shot is ruined because it's too slow."},"57":{"post_title":"Had a Pixel 8 for less than 10 12 hours and App Drawer is making me wat to return it","self_text":"I just picked up a Pixel  8 last night and don't know if I can deal with it. There doesn't appear to be a way to organize the apps in the app drawer. WHY ON EARTH IS THIS NOT A FEATURE???? I have a lot of apps, and I want to be able to look them up by category. Like if having a finance folder, and a folder for outdoor recreation, or one for food related apps. I know I can make folders on the home screen but then being able to swipe up and access the app drawer is now completely useless and just annoying. Is there a way to disable the swipe up? This is being so unbelievably frustrating to me that I am very tempted to return this phone."},"58":{"post_title":"Pixel 9 face ID doesn't work as well as iphone 12 in dark settings?","self_text":"My iphone 12's face id worked very well in dark settings. I could be in a dark room, and be able to unlock my phone using my face on the lowest brightness setting. I just tried a pixel 9 and it doesn't seem to work at all in dark settings"},"59":{"post_title":"Emergency SOS...the new way to send nudes to friends","self_text":"My day started off quite interestingly...have to share this one 😅I went to bed a little late last night, but had to be up at 8am for some stuff. Set an alarm, no big deal.8am rolls around, and I wake up to the familiar ringing sound. Half asleep, I start swatting at my phone, trying to press buttons to shut it up. In the process, I somehow hit the power button 5x and set off Emergency SOS.The gentle ringing alarm turns into that blaring siren sound, jolting me about 5ft in the air, scrambling to stop it. I grab my phone and look at the screen (still half asleep). I see the notifications for \"calling 911\" and stuff about sending location and whatever else to emergency contacts. I'm thinking \"SHIT emergency services are going to come, my friends will get scared, and I'm just laying here naked in bed!!\"I cancel everything, and scramble to type in \"phone glitched\" for the reason I'm canceling the SOS, before I scare some 12 emergency contacts.The phone starts ringing and texts start coming in. Friends are concerned...but not so much about my safety but rather that **MY PIXEL SENT EVERYBODY PHOTO\/VIDEO OF ME NAKED** 😅😅**So yes, Pixel's SOS features are a great way to send dick pics to people, folks.**Hope this gave everyone a good laugh. Before anyone gets all serious, yes I know I can change SOS to require I hold the circle on the screen for 3 seconds, and nobody was upset or offended. My embarrassment gave everyone a jolly start to their day or a fun 1am booty call, depending on time zone.**CENSORED \\*\\*but still NSFW\\*\\* PICS YOU'VE ALL BEEN BEGGING ME FOR:** [**https:\/\/imgur.com\/a\/ort8yxD**](https:\/\/imgur.com\/a\/ort8yxD)*\\*Mods, if this isn't okay, please just remove the link or DM me and I will. It is censored, and so many people keep asking...given it's making everyone laugh, I hope you don't remove my whole post❤️\"**\\*\\*No, I will not provide uncensored pics, here or via DM. Sorry!*"},"60":{"post_title":"Google announces early August 13 event for Pixel 9 and Pixel Watch 3","self_text":""},"61":{"post_title":"Why I'm Returning the OnePlus 13 and Keeping My Pixel 9 Pro XL","self_text":"After spending time with both phones, here's my experience:**Why I'm returning the OnePlus:**1. Design Issues   * The offset camera placement on the back is awkward   * Not a fan of the partially curved display design2. Software Problems (OxygenOS)   * Inconsistent UI that feels like a mix between ColorOS, PixelOS, and iOS   * Frequent notification bugs   * Horrible sound quality to external sound devices   * Strayed too far from the original OxygenOS philosophy3. Camera Limitations   * Inconsistent performance   * Subpar low-light photography   * Inaccurate color science**The Good Parts of OnePlus:*** Excellent performance thanks to the Snapdragon chip* Great mobile coverage* Very fast charging (though the 6000mAh battery life is average)**Why I'm Keeping the Pixel:*** More responsive display, especially noticeable during fast typing* Superior camera performance* Consistent PixelOS experience throughout the system* Timely security updates, which is crucial in today's hostile internet environmentI might have kept the OnePlus if they had maintained their original OxygenOS approach and provided timely security updates. Currently, it feels too similar to other Chinese smartphones, losing its unique identity."},"62":{"post_title":"I’ll be comparing the iPhone 16 Pro Max, Pixel 9 Pro XL, and OnePlus 13 – Ask Me Anything!","self_text":"Hey everyone!I’m about to receive my OnePlus 13 any moment now, and I’ll be comparing it with the iPhone 16 Pro Max and Pixel 9 Pro XL. I’ve bought all three phones with my own money, so you can expect a completely unbiased comparison and honest answers to any questions you have.I’m not loyal to any brand or a superfan of any particular company. I’m just a tech enthusiast and cybersecurity expert who genuinely enjoys exploring the latest tech. Whether it’s hardware, software, or security-related features, feel free to ask me anything.For context, my current daily driver is the Pixel 9 Pro XL. It’s been the most balanced phone for me so far, but who knows—maybe the OnePlus 13 will change that! I’m excited to see how it stacks up.Drop your questions below, and I’ll do my best to answer them or provide comparisons once I’ve had a chance to test all three!Cheers!"},"63":{"post_title":"IPhone 13 user wanting to go to Google Pixel; any advice?","self_text":"Hi everyone,I’ve been considering switching to Android, and specifically to a Google Pixel.I’ve been an iOS user my entire life, but honestly, it’s starting to feel a bit mundane for me. I think Android might suit my needs and preferences better.Initially, I was looking at the Google Pixel 9 Pro, but I started to worry, what if I don’t like it? I’d end up spending a lot on a phone I’m not happy with.So, I’ve been thinking about getting the Google Pixel 7a instead. Would it be a good idea to use the Pixel 7a as a way to test out whether the Pixel is right for me, especially coming from an iPhone 13?"},"64":{"post_title":"Do you consider switching from your Pixel to 1+13","self_text":"The hardware is tempting but I'm pretty sure that I will not stand it for more than a week. The OxygenOS is a blatant copy of IOS and I'm not convinced about the update policy especially timely security updates which are the most important updates on a phone. So I'll stick to my Pixel 9 Pro XL. Yes it is not so powerful but it doesn't feel so lame. "},"65":{"post_title":"Unfortunately, after 13 years, I'm leaving team Pixel.","self_text":"And I know you all don't care (I wouldn't). But I'm not happy that it came to this. I'm in love with Pixel phones, but P8 have a problem (known and well spread) that is making me change the brand.My last Pixel is Pixel 8 (after Nexus 4, Nexus 5, Pixel 2, Pixel 3, Pixel 4a, Pixel 6) and in last couple of months I'm having a problem with me being unavailable for gsm calls (or calls go to voicemail). My dad is terminally sick and I can't afford to lose calls at the moment. Seems there's no fix for this, so have to sell the phone. Don't know what I'm going to get, but something people can call me on, at least. This problem is really something I can't overlook, and will not be getting Pixel again.If you know the fix, which I couldn't find, please save me and help.Cheers friends."},"66":{"post_title":"All Pixel 9 Pro upgrades over Pixel 9","self_text":"Below is the list of all the upgrades you get in the pro phone -1. 1mm extra screen size (insignificant)2. Slightly thinner bezels (insignificant)3. LTPO display (1Hz minimum) (better standby battery life, especially with AOD)4. Slightly Higher Display Resolution5. Higher HDR and peak brightness levels (better outside visibility)6. Vapour Chamber (better thermals and lesser throttling)7. ~~4GB~~ 1.4 GB extra RAM (better multitasking) (2.6GB RAM is reserved for AI tasks, regardless if you use it or not) [*moreinfo*](https:\/\/www.androidauthority.com\/tested-pixel-9-pro-ai-ram-3472624\/)8. Telephoto Camera (48MP) (5x zoom)   1. 8K 30FPS video (artificially upscaled to 8K)   2. Super Res Zoom Video9. 42MP selfie camera (wider)10. Pro controls in Google Camera (software locked by Google)11. Matte back glass + Polished rails12. 1 Year Free Google One subscription (with 2TB storage + Gemini Advanced) (only for purchases before 31st Oct 2024)13. Ultrawideband Support14. ThermometerAll the differences are lised in a single place to help make a more informed purchase decision(do list any differences that I might've missed and I'll add it in the list)"},"67":{"post_title":"Interested in OnePlus 13 but fear I'll miss out on Pixel exclusives","self_text":"Currently, I'm a current Pixel 7, on Google Fi and a Google 1 subscriber. I'm interested in the OnePlus 13 but I'm wondering what I'll miss about Pixel ownership. I know the OnePlus should do all the Google Assistant and Gemini things. I think I'll lose some spam blocking on phone calls. I also think I'll lose Google Photos AI photo tools, but maybe that comes with any phone with Google Photos and Google 1?What features am I not considering?"},"68":{"post_title":"On hand comparison: Pixel 9 vs Oneplus 13","self_text":"As all things end, I will start with a disclaimer. The oneplus i13 is running color OS with China ROM.Now, I have had both of this devices for a week now. By some cruel twist of fate, I lost my s23Ultra, and someone gifted me the P9 while I bought the OP13.These two devices are such a big contrast in design language. The pixel 9 feels better in hand, like a warm blanket. The oneplus is a cold device. It ticks every mark. Battery life is superb, network connectivity is great, display is stunning, but I keep reaching for my P9.The oneplus has its advantages. 1.5day battery life is great. Charging to 100% while am in the shower is amazing. I have no battery anxiety with this phone. P9 is a 18hr phone. And it charges so slowly that I have to leave it plugged overnight, lest I wake up  with a dying battery.The display on the OP13 is really good. The colors vivid. the P9 has a very weird issue with screen brightness sometimes where it goes very dim in shaded areasThe cooling performance is worlds apart. I have never felt the OP13 overheat. The p9 starts overheating immediately I connect to Android Auto (OP13 doesnt have android auto yet)Cameras the pixel 9 shines, although I think the OP13 has also really good shots. I am not a big camera afficianado, so I would say they both have good photos compared side by side.  In summary, the OP13 has my cold logical mind. The P9 has my heart"},"69":{"post_title":"PixelOS for Redmi Note 13 Pro? (I have unlocked bootloader now need new OS)","self_text":"As per title, I have successfully unlocked the bootloader and went to[https:\/\/pixelos.net\/download](https:\/\/pixelos.net\/download)but I cannt find Xiaomi Redmi Note 13 Pro on there. I looked on many youtube tutorials and the links they had to the files don't work anymore.Does anyone know what the story is? Can anyone help me get Pixel OS onto my phone? Thank you"},"70":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"71":{"post_title":"Streaming HD video over wifi the Pixel 9 Pro lasts 17:25hrs, Pixel 9 Pro XL 12:24hrs, and Pixel 9 lasts 11:45hrs.","self_text":""},"72":{"post_title":"Do you think pixel 6a might get android 17?","self_text":"I've heard the pixel 6 series has been extended to get android 16. Do you think Google might extend them to android 17? Of course it's only speculation."},"73":{"post_title":"Weekly #TeamPixel Photos Megathread October 17 2024","self_text":"This is the weekly photo Megathread. Photos captured with your Pixel (or other Google devices) posted outside of this thread are not allowed. Also, please mention the device you took the photo with. For more pictures, check out r\/pixelography.**\\#TeamPixel***An archive of past photo Megathreads can be [found here](https:\/\/www.reddit.com\/r\/GooglePixel\/wiki\/photos).**To return to the Superthread, [click here](https:\/\/reddit.com\/r\/GooglePixel\/about\/sticky?num=2).*"},"74":{"post_title":"Google Pixel Fold (Original) - Review after 17 months of use","self_text":"I was very excited to purchase this phone back in June 2023. The pros are obvious and stated by other users here as well as on CNET, Wired, CNET, etc. On the flip side, the phone has fallen victim to the same fallacy affecting other first-generation novelties - focusing on the breakthrough feature but sacrificing both basic features associated with a smartphone. Moreover, the Fold (even when compared to the Galaxy) is quite rudimentary and lfalls short with heuristics that define the user experience interacting with a table-type phone.* Battery - Terrible as always. I’ve never had a Pixel phone where I didn’t have the battery saver on by defaults nd it still dies within 3\/4 of my day without charge* No good case - Even , the front portion of the case easily loses its adhesiveness around the 2-3 mm border. This is more of an issue with the case, but the design of the phone itself does not allow for an appropriate case for the front panel* Front panel - Very difficult to backwards swipe to go to a previous web page when viewing in a broswer- will usually just translate to the next Home Screen panel * Fold display - this clearly a first draft and I wish I had waited for the third. So many issues:   * Screen takes 2-3 seconds to “turn on” when unfolding the phone   * Google tries very hard to describe the two panel feature, but it is FAR from self-explanatory. Moreover, even basic apps from Google do not function properly, with many text-entry app functions missing the keyboard for swipe or text (forcing me to fold the phone to the single display to have the keyboard pop up)   * Several apps will take up 1.t5 screens   * They keyboard, when it appears, has a humungous gap in the keyboard between the panels, making swype inefficient and unusable* Incompatibility between Gmail and Dropbox - this apparently is an issue for all Google \/ Android phones* Ongoing Android\/iPhone MMS disconnect - leading to granular video appearing when Apple and Android users are together on MMS* Unlocked phones have data reconnecrtivity issues after switching to Wi-Fi for calling (no signal) but then having an issue with the Wi-Fi at the location itself. After a couple hours, once you leave the dead zone area and return to 5G\/LTE areas, the phone can take hours to reconnect to Verizon. Even with toggling Airplane mode, SIM card, and multiple restarts* Awkward tapping of the rear horizontal camera panel to take a screenshot - absolutely inconsistent and clumsy * Significant lag in accessing text messages especially when you have multiple years of conversations stored)* Camera quality IMHO took a hit compared to Pixel 6 and predecessors* Verizon general signal issues."},"75":{"post_title":"Pixel 9 Pro XL charging surprise hints at a big change in how Google is approaching charging.","self_text":"Playing around with the various Anker chargers I had on hand and a USB-C power meter, I noticed something a bit shocking about the charging of the Pixel 9 Pro XL.When I looked at the charge specs of the 45 watt official charger, I saw that the PPS spec was defined as such.\"PPS: up to 11V\/3A, 16V\/3A, 21V\/2.25A max 45W\"Immediately I noticed that amperage maxed out at 3amps for the various ranges (with less for the 21v).  This was a departure on how Samsung gets 45w output where they keep it at around 11v and up the amperage to 4amps.  This has a side effect of requiring a 5A (emarked) cable for max charge rates. So, I looked at that and thought that Google must be using some voltage higher than 11v to get that 37w.  So, I was assuming they were doing something like 12.3v@3A or maybe possibly 16v@2.3A.  I doubted the later though since that was a pretty high voltage transformation to do in a phone.Well, I tried one of my Anker chargers that did 3.3v-16v@3A and discovered that it topped out at 27w even at a lower battery state.  I tried another and noticed the same.Then I tried my Anker Prime 2700 battery bank which goes up to 21v with PPS and it immediately jumped up to 32w (the battery wasn't fully drained).  What surprised me is that it was 17.9v@1.78a.  Actually, surprised doesn't even cover it, I was gobsmacked.This is pretty unheard of in the mobile world.  Voltage transformation typically generates a lot of heat so the popular approach is to increase amps.  You see it with the Samsung Super Fast Charging 2.0 with the 11v@4A output.  You even see it with something like SuperVOOC with OnePlus (80w is 11v@7.3A).This is why I've always felt that manufacturers that wanted to stick to the PD spec were going to run up against a hard ceiling around 55w or so for fast charging these phones since you wouldn't really want to stray beyond 11v.  However, here comes google charging at nearly double the voltage and I'm kinda stunned that no one is talking about it.There's a few significant things about this.  First, there's going to be lower compatibility across existing PPS chargers out there.  Some do go up to 21v, but most of the Anker stuff that's out there tops out at 16v and sometimes 11v.  It seems that if you can't do \\~18v PPS, the P9PXL will top out at 27w essentially doing 9v@3a.  So, that's something to be aware of if you stray from Google's official charger.  It looks like a few of the Ugreen ones go up to 21v so they may work properly.  Companies are really shoddy (Anker, I'm looking at you) about giving all their charging specs so it's likely going to be a bit rough finding 3rd party chargers that go at max rate.Second, I can't think of any reason why Google would be doing this unless they had plans to go BIG with charging down the line and this is the first step.  Unless I'm grossly mistaken, this requires specifically chosen and not so common hardware in the charging circuit design to have a charge pump that does this extreme of a transformation.  There's no real reason to go this route instead of upping the amperage unless you wanted to go beyond the 50w mark in the future as far as I know.  This also highlights Google's heat mitigation for this year's models since the reason why this much voltage transformation is traditionally not done is because it generates heat.I want to point out again that I don't understand why some more technical minded publication hasn't run with this yet.  I'm far from an expert in things like charging, I just know enough to spot something that's an outlier and recognize the general constraints of smaller mobile devices.  I would love for someone who really understands PD design and charging circuits to really dig into this and all the implications.  This was a deliberate choice by Google and it is a very unusual one (and frankly bold for a company that usually plays it safe.)"},"76":{"post_title":"Google Pixel 9 Pro pre-order in India starts Oct 17 (Flipkart)","self_text":"Finally the flipkart page for Google Pixel 9 Pro (non-XL) has been updated from being basically non-existent to showing that the pre-orders will start this week!Does anyone have any idea when they might start shipping it, will we have to wait till November as suggested by Google's account informing people in the comments?"},"77":{"post_title":"Got the pixel 7A for £17 a month ","self_text":"On a 24 month contract with 300gb data. Is that a great deal?"},"78":{"post_title":"I just saw someone still using a Pixel 2 ","self_text":"I recognized it immediately by the rear fingerprint scanner and out-of-color power button. And also because I used to have one myself. I felt a proud Pixel owner seeing as Google made a device so good that somebody could still be actively using it 7 years after launch. And a little jealous cause I couldn't help unnotice that he was enjoying a good service on his Snapdragon modem while my Exynos was struggling to maintain reception. Granted, it was in a coffee shop and dude was seated a little closer to the window but still... The 5300 is several generations newer. It's also a nice testament to Google's chosen 7-year support. It's clearly not an arbitrary number. If phones can last as long hardware-wise and people are willing to use them for that long, then why shouldn't Google let them do it in a secure manner, right? "},"79":{"post_title":"Google Find My Device network might launch soon as iOS 17.5 preps tracking alerts","self_text":"[https:\/\/9to5google.com\/2024\/04\/02\/find-my-device-launch\/](https:\/\/9to5google.com\/2024\/04\/02\/find-my-device-launch\/)From the article: \"Looking at past schedules, iOS 17.5 might launch in May. After that update sees wide adoption, Google’s FMD network will be clear of any obstacles.\"  "},"80":{"post_title":"Android 15 vs iOS 18 ","self_text":""},"81":{"post_title":"Wtf? Apple in Talks to License Google Gemini for iPhone, iOS 18 Generative AI Tools - Bloomberg","self_text":""},"82":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"83":{"post_title":"Pixel 9: 22,5 W charger charges 18 % in 30 min","self_text":"Hi,got my Pixel 9 and using my Huawei 22,5 W Fast charger.Pixel 9 says that I should check my charger because its either slow charging or not charging at all.  Well is this normal?The Pixel 9 charger from Google offers 27 W charging, so only 5 W more. Cant imagine that this will increase the charging speed much.  Do I miss something? Really curious, because there are many phones out therer alrdy charging with 100 W...."},"84":{"post_title":"I'm 18 but still have parental controls","self_text":"It's not the whole phone only the play store and I've asked my parents to check it and they said it's not an issue on their end and that they have no input on it. I've put the correct pin in when asked to turn it off but everytime I try to do so it says it can't save it and doesn't work.Is this a known issue or is my playstore just acting up?"},"85":{"post_title":"'device too warm, exposure controls limited'. It's 18°c...","self_text":"It's a slightly warm day here in the UK (a whole 18°C), I've taken maybe 5 short video clips in the sun, and went to take a photo a minute or two later.I was met with a new warning - \"Device too hot exposure controls limited\"What fresh hell is this?What happens if we actually have good weather this summer?This phone, man..."},"86":{"post_title":"Are there any plans to make Gemini Live and\/or Screenshots available to people under 18?","self_text":"I bought the P9P as my first phone, and I'm really enjoying the features it comes with. However, since I'm under 18, a handful of useful features such as Gemini Live, Screenshots, and Pixel Studio aren't available for my use.With the recent updates that have come following the S25 release, are there any plans to make these apps and features available to younger people like me?"},"87":{"post_title":"Problem with Pixel Studio on Pixel 9 Pro XL: 'To use Pixel Studio, you must be 18 or older'.","self_text":"Edit - Resolved (worked around) by making a new google account. The new account lets me in with the same birthdate, but the old one still does not.Original Post:But my age is correct in the google account and it's many years beyond 18. As soon as I click 'Continue as ItsMopy' it presents me with this message on a blank screen, and a close app button, nothing else. Any thought on what I could change to get it let me access it?"},"88":{"post_title":"Beware of Android 15 and iOS 18 updates if using Dexcom and Stelo diabetes management apps\n","self_text":"[https:\/\/techissuestoday.com\/dexcom-and-stelo-apps-compatibility-android-15-and-ios-18\/](https:\/\/techissuestoday.com\/dexcom-and-stelo-apps-compatibility-android-15-and-ios-18\/)"},"89":{"post_title":"Phone lostb13% in 18 minutes","self_text":"Is normal?"},"90":{"post_title":"Samsung temporarily halts Galaxy Buds 3 Pro sales, says sorry for quality issues","self_text":""},"91":{"post_title":"CMF by Nothing: CMF Phone 1 makes record breaking sales of 100,000 units in just 3 hours.","self_text":""},"92":{"post_title":"Exclusive: Google Cancels Pixel Tablet 3 Development","self_text":""},"93":{"post_title":"Tensor G4 vs Snapdragon 8 Gen 3: Benchmark & Specs Comparison","self_text":""},"94":{"post_title":"Loss of Pulse Detection has received U.S. FDA clearance, and is now available on Pixel Watch 3.","self_text":""},"95":{"post_title":"Samsung's Second-Gen 3 nm GAA Process Shows 20% Yields, Missing Production Goals","self_text":""},"96":{"post_title":"\"mini\" now means 6.3\" - vivo X200 Pro mini","self_text":""},"97":{"post_title":"Google Wallet will let you make digital IDs with US passports, 3 more state IDs coming ","self_text":""},"98":{"post_title":"qBitController is a free and open-source app for controlling qBittorrent - a popular torrent client, from an Android device. It has just reached the 1.0.0 milestone and has added features like Material Design 3\/You support, adding multiple torrents at a time, and several fixes.","self_text":""},"99":{"post_title":"This is Microsoft's canceled Surface Duo 3 foldable smartphone","self_text":""},"100":{"post_title":"Snapdragon 8 Gen 4 in the OnePlus 13 appears on Geekbench and flexes wicked CPU clock speeds","self_text":""},"101":{"post_title":"Samsung Galaxy S24 Ultra runs Fallout 4 and many other PC games with more than playable frame rates","self_text":""},"102":{"post_title":"Adreno 830: Snapdragon 8 Gen 4 GPU rumoured to be 57% faster than last-gen counterpart","self_text":""},"103":{"post_title":"Report claims the Snapdragon 8 Gen 4 might require larger batteries","self_text":""},"104":{"post_title":"First Snapdragon 8 gen 4 spotted on Geekbench","self_text":""},"105":{"post_title":"Samsung's Galaxy A55 and A35 are official with 6.4\" OLED screens, focus on security","self_text":""},"106":{"post_title":"Pixel 11 could bring back a very useful feature from the Pixel 4","self_text":""},"107":{"post_title":"Exclusive: Google Pixel 8a Leaks in all 4 colors","self_text":""},"108":{"post_title":"Play Store now allows updating tons of app simultaneously (not just 3 or 4)","self_text":""},"109":{"post_title":"Galaxy S25’s Exynos 2500 to be more efficient than Snapdragon 8 Gen 4","self_text":""},"110":{"post_title":"Report: Samsung using new battery tech in Galaxy S26 with ‘monster’ capacity over 6,000 mAh","self_text":""},"111":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"112":{"post_title":"33,000mAh battery runs fat smartphone for over 6 months on 1 charge","self_text":""},"113":{"post_title":"The first cheap Samsung phone to get 6 years of Android updates is here \/ The Galaxy A16 5G is the first Samsung device in its category to promise six generations of Android updates and six years of security patches.","self_text":""},"114":{"post_title":"9 years ago on this day, Android Lollipop was released. Nexus 6 also released in November and was amongst the first to receive Android 5.0.","self_text":""},"115":{"post_title":"Android 15 update is bricking some Pixel 6 devices","self_text":""},"116":{"post_title":"Walmart releases $50 Onn 4K Pro streamer w\/ 32GB Storage, 3GB RAM, WiFi 6, hands-free voice control, and more","self_text":""},"117":{"post_title":"Galaxy A26, A36, A56: Samsung plans 6x Android, 6 years of updates","self_text":""},"118":{"post_title":"The OnePlus 13 might include a massive 6,000mAh battery, but it comes at a cost [no wireless charging]","self_text":""},"119":{"post_title":"ASUS is launching the Zenfone 12 Ultra on February 6","self_text":""},"120":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"121":{"post_title":"Exclusive: This is the Samsung Galaxy Z Fold 7","self_text":""},"122":{"post_title":"7 years and still using the same phone | It's a budget android.","self_text":"I'm not sure if this subreddit is the perfect one to post this on but if not I apologise.So I got my first phone back in March 2018. It's a Redmi Y2\/S2. I've been using it as my primary device for almost 7 years. Now I've been using it with custom roms and that's how I got new software on old hardware. Currently it's running lineage 22.1 (android 15) and still amazing.It doesn't have a good processor (snapdragon 625) but it's a powerhouse, it lasts really long hours even though it's just 3000mah. Now the lag is probably because of low ram and storage that is 3\/32 but it works out for me. I still play games like (shadow fight 2) (carx rally) etc.Whenever i think of upgrading to a new one I feel the feeling of losing something important since I have quite a lot of memories attached to this phone and I just don't want to say goodbye to it yet.It still has decent camera, taking pictures are pretty good since I've been using \"Google Camera\" and it's awesome. I've been using it for this many years and it's camera still blows my mind (maybe due to google cam)I've broken the screen once and got it replaced back in 2020 and also got the battery replaced but still don't have the mind of updating to a newer modal.I'm pretty sure that even if I hadn't installed custom rom on it I still would've been using it till today (i could've just formatted it countless times). It had android 9 at the start and after update would've gotten to android 10.I'm amazed by people who really genuinely believe that phones need to be upgraded every 1-2 years, if you have the mind you can use it for as long as the software supports it.  EDIT: Wow I never expected the post to get this much engagement, thanks for all the comments, love you all !and also my father also needed a new phone so i pulled out the galaxy s2 and installed android 7 on it with lineage (originally it was on android 4). And it's working pretty nicely. "},"123":{"post_title":"Samsung is redesigning Good Lock with One UI 7 alongside global Play Store release","self_text":""},"124":{"post_title":"One UI 7 lets you stop HDR photos from making your screen super bright","self_text":""},"125":{"post_title":"Samsung confirms One UI 7 rollout for all Galaxy S series phones","self_text":""},"126":{"post_title":"Exclusive: Samsung One UI 7 First Look and Key Features Revealed","self_text":""},"127":{"post_title":"Google Authenticator 7.0 rolls out Material You redesign, search, & more","self_text":""},"128":{"post_title":"7 Years of Android Updates. Can Google & Samsung Really Deliver?","self_text":"I’ve been thinking about Google and Samsung’s promise to support their latest phones for 7 years. On paper, it sounds great, but will the updates actually be useful, or will they just slow down devices like some claim Apple does? Most Android brands like OnePlus and Xiaomi barely offer 3-4 years, so this is a huge step. But will they actually keep it up long-term?"},"129":{"post_title":"Ice Universe: Galaxy S25 Ultra camera specifications have been confirmed. The only upgrade is the ultra-wide-angle sensor, 50MP 0.7um ISOCELL JN3 sensor, the main camera 200MP HP2 (small process upgrade model unchanged), 3x is still 10MP IMX754, 5x is still IMX854 50MP 0.7 um","self_text":""},"130":{"post_title":"Exclusive: Google picks a MediaTek modem for the Pixel 10 series","self_text":""},"131":{"post_title":"HTC One M8: The Android GOAT, 10 Years On!","self_text":""},"132":{"post_title":"Exclusive: Huge Pixel 10 and 11 leak reveals Google Tensor is following in the iPhone's footsteps","self_text":""},"133":{"post_title":"Google Pixel 9 successor: First proof of a \"Samsung-free\" Tensor G5 chip in the Pixel 10","self_text":""},"134":{"post_title":"10 updates coming to the Android ecosystem","self_text":""},"135":{"post_title":"Google Tensor G5: Pixel 10 series' SoC allegedly tapes out on TSMC's 3 nm node","self_text":""},"136":{"post_title":"Full Tensor G5 specs reveal big and small changes coming to the Pixel 10","self_text":""},"137":{"post_title":"Pixel 9 Pro XL is one of the top 10 premium phones in the US","self_text":""},"138":{"post_title":"Monument Valley at 10: the story of the most meticulous puzzle game ever created","self_text":""},"139":{"post_title":"The RedMagic 10 Pro Plus is basically a power bank attached to a gaming phone","self_text":""},"140":{"post_title":"HTC is teasing a new phone! To be revealed June 12.","self_text":""},"141":{"post_title":"ASUS is launching the Zenfone 12 Ultra on February 6","self_text":""},"142":{"post_title":"OnePlus 12 5G Smartphone Review: Near-Galaxy S24 Ultra flagship experience for half the price","self_text":""},"143":{"post_title":"ASUS Announces Zenfone 12 Ultra - ASUS Pressrooom","self_text":""},"144":{"post_title":"Qualcomm releases Snapdragon 6 Gen 4 - x1 Cortex-A720 Prime core at 2.3 Ghz, 3x Cortex-A720 performance cores at 2.2 GHz, 4x Cortex-A520 efficiency cores at 1.8 GHz - supposes to offer 11% improvement in CPU performance, 29% improvement in GPU performance, and 12% improvement in battery life","self_text":""},"145":{"post_title":"Asus Zenfone 12 Ultra: this is the new top smartphone","self_text":""},"146":{"post_title":"Asus Zenfone 12 Ultra review","self_text":""},"147":{"post_title":"Switching back to S23 Ultra after a week with the Oneplus 12","self_text":"I got the Oneplus 12 because of its DC dimming and higher PWM at lower brightness, but after a week with it, I was itching to switch back to my S23 Ultra. Thoughts:Negatives:1) Nova Launcher doesn't work smoothly with gesture controls, there's a noticeable lag when I swipe to home. I thought it won't be a big deal, but couldn't stand it after a few days. 2) I miss the One Hand Application app for Samsung, that gave me a bunch of side of the screen gesture actions. I tried a few apps off the Google play store but I couldn't find one as reliable. 3) I miss the S pen, good for precise actions, remote camera triggers, and the occasional live sketch. 4a) I found the colors on the Samsung generally more accurate, with the Oneplus giving most photos a warmer tint than irl. Oneplus sometimes seem to have sharper images though, but that might be due to processing. Night photos and videos seem better on the Samsung. 4b) I also miss the 10x camera, which is great for travel and animal photography. 4c) No motion photos on the default oneplus camera app. I like the little snippets of video attached to each photo.5) One UI just feels more polished as an OS, more finalized and less improvised. 6) Samsung Pay turns NFC on and off automatically which seems more secure to me.  Positives1) The screen does feel slightly more comfortable on the OnePlus, so I might switch back to it if my eye strain comes back. I can see the flicker in the Samsung if I wave my fingers across the screen when it's dim.2) I can't seem to get true blacks in dark mode in a few apps on the Samsung, like Instapaper, while the Oneplus has it. 3) Screen off gestures are pretty convenient on the oneplus, especially the torch.4) The oneplus is lighter and less bulky. 5) The haptics are stronger and feel more satisfying on the oneplus. 6) Battery life seems longer and charging is faster. Anyone have thoughts that might make me change my mind again? "},"148":{"post_title":"Asus Zenfone 12 Ultra launches with Snapdragon 8 Elite, improved gimbal stabilization -GSMArena","self_text":""},"149":{"post_title":"Redmi Pad Pro debuts with 12.1” IPS LCD (1600p 120Hz) and SD 7s Gen 2 (from ¥1499\/$207)","self_text":""},"150":{"post_title":"OnePlus 13 Smartphone Review: Let the battery revolution begin","self_text":""},"151":{"post_title":"Oneplus 13 Megathread","self_text":"[Live stream](https:\/\/www.youtube.com\/watch?v=QODMZuqbhhI)Reviews:[OnePlus 13 - Really The New Best Affordable Flagship? - TechTablets **pre global launch.**](https:\/\/www.youtube.com\/watch?v=oMUCm94CjjY)[OnePlus 13 vs. The World! Two Months Later... - Techmo **pre global launch?**](https:\/\/www.youtube.com\/watch?v=_gEvmud9EDI)[OnePlus 13 Review (Global Edition) - Tech Spurt](https:\/\/www.youtube.com\/watch?v=T6NWB6l8yiE)[OnePlus 13 Review: Lucky Number 13 JuanBagnell](https:\/\/www.youtube.com\/watch?v=KwVdAsbAMM4)[OnePlus 13 Review - Finally Back to their Roots! HowToMen](https:\/\/www.youtube.com\/watch?v=14HOTW9cjKA)[I Spent Almost A Month with the OnePlus 13 and Here's What I Discovered- TK Bay](https:\/\/www.youtube.com\/watch?v=rNmYjgm7AI4)[OnePlus 13 (Global) Review: The Most Complete OnePlus Phone Ever - ben's gadget reviews](https:\/\/www.youtube.com\/watch?v=zo48vAgBsA8)[OnePlus 13 Review: They Finally Did - Android Digest It](https:\/\/www.youtube.com\/watch?v=i_AyfCUVM_8)[OnePlus 13 Review: The Bar Has Been Set! - Marques Brownlee Set!](https:\/\/www.youtube.com\/watch?v=-kuG6RgL32c)[OnePlus 13 full review - GSMARENA](https:\/\/www.youtube.com\/watch?v=dJqK2lvrZNk&pp=ygUIZ3NtYXJlbmE%3D)[OnePlus 13 Review: The Best OnePlus Phone Ever! - Beebom](https:\/\/www.youtube.com\/watch?v=SFS_cZS-4iY)[The flagship killer has become the flagship - OnePlus 13 ShortCircuit](https:\/\/www.youtube.com\/watch?v=0fePd1BoqN4)[OnePlus 13 Review: Ship Shape? MrMobile (Michael Fisher)](https:\/\/www.youtube.com\/watch?v=bDJNd8XWJIU)[OnePlus 13 - The Comprehensive Review - Wildman Tech](https:\/\/www.youtube.com\/watch?v=Y0NtvXxwbwU)Camera review\/comparison:[Is Oneplus 13 Camera Good Enough for Professional Photography? - Through Jermaine's Lens **pre global launch**](https:\/\/www.youtube.com\/watch?v=rIwzDwe3jfg)[Oneplus 13 vs Oneplus 12 Camera Comparison! - Through Jermaine's Lens **pre global launch.**](https:\/\/www.youtube.com\/watch?v=ynLN-fU4a6Q)[Oneplus 12 vs Oneplus 13 LOW LIGHT Camera Comparison - Through Jermaine's Lens **pre global launch**](https:\/\/www.youtube.com\/watch?v=iCXGlVBLdyM)Articles:[REVIEW: The OnePlus 13 is a Super Reliable Phone that’s Never Gonna Let You Down - Mishaal Rahman](https:\/\/x.com\/MishaalRahman\/status\/1876668095156342887)[OnePlus 13 review: The best Android phone you can stick in a dishwasher - android central ](https:\/\/www.androidcentral.com\/phones\/oneplus-13-review)So I'm going to do something different for this mega thread. The OnePlus 13 already launched in China and some reviewers already made review\/content about it. I will also post those as well here, but I will organize them based on what those videos are. I will also denote the video pre global launch. As usual, if you guys find any videos that I miss, please let me know and I'll put them in the thread. Thanks!"},"152":{"post_title":"Ahead of Android 15's launch, Android 14 is on at least 13% of active devices","self_text":""},"153":{"post_title":"Snapdragon 8 Gen 4 in the OnePlus 13 appears on Geekbench and flexes wicked CPU clock speeds","self_text":""},"154":{"post_title":"S25 Ultra vs OnePlus 13 - Samsung has no Excuse! (Heavy Workload Test)","self_text":""},"155":{"post_title":"The OnePlus 13 might include a massive 6,000mAh battery, but it comes at a cost [no wireless charging]","self_text":""},"156":{"post_title":"It's official: The OnePlus 13 is coming and will launch very soon","self_text":""},"157":{"post_title":"OnePlus 13 arrives with Snapdragon 8 Elite and 6,000 mAh battery","self_text":""},"158":{"post_title":"New OnePlus 13 Mini leak contradicts previous camera rumors","self_text":""},"159":{"post_title":"[GSMArena] iQOO 13 Review","self_text":""},"160":{"post_title":"Google is preparing a major overhaul to notifications and Quick Settings in Android 16","self_text":""},"161":{"post_title":"Google may redesign the volume UI in Android 16, and here's a first look","self_text":""},"162":{"post_title":"Android 16 Beta 2 lets you double press the power button to open Google Wallet","self_text":""},"163":{"post_title":"Android 16 could let apps show Dynamic Island-like notifications","self_text":""},"164":{"post_title":"Here's your first real look at Live Updates in Android 16","self_text":""},"165":{"post_title":"Android 16 could turn Wi-Fi and Bluetooth into one-click toggles once again","self_text":""},"166":{"post_title":"Android 16 Beta 2 forces apps to go edge-to-edge and enhances Ultra HDR","self_text":""},"167":{"post_title":"Google may let you resize Quick Settings tiles in Android 16","self_text":""},"168":{"post_title":"Android 16 DP2 lets you use your Pixel's Fingerprint Unlock even when the screen is off","self_text":""},"169":{"post_title":"Google confirms Android 16 is coming earlier than usual, developer preview begins soon","self_text":""},"170":{"post_title":"A slimmer Galaxy S25 could rival iPhone 17 Slim","self_text":""},"171":{"post_title":"Google Find My Device network might launch soon as iOS 17.5 preps tracking alerts","self_text":""},"172":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"173":{"post_title":"Android turns 17: From beta to global dominance","self_text":""},"174":{"post_title":"Microsoft is ending support for Windows Subsystem for Android","self_text":""},"175":{"post_title":"Google is preparing a major overhaul to notifications and Quick Settings in Android 16","self_text":""},"176":{"post_title":"If you have switched from Apple or stayed with Android, tell me why? ","self_text":"I've been a long time android user, but given the rumors about the iPhone 17, I'm considering switching next year. So I'm looking for the reasons people didn't or don't switch over, or reasons why Apple users have switched to android. Thanks! "},"177":{"post_title":"evleaks: Sony Xperia 1 VI marketing material","self_text":""},"178":{"post_title":"System apps that could be uninstalled without breaking any functionality in Samsung devices","self_text":"I was trying to debloat my Samsung A14 5G device without root using [Canta](https:\/\/github.com\/samolego\/Canta) and [Shizuku](https:\/\/github.com\/RikkaApps\/Shizuku). While trying to find safe apps to remove, I couldn't find any articles online listing bloated apps in OneUI so made one myself, sort of.Listed below all the apps I could uninstall without harming any functionality of Android. I have been using this device for a week and I haven't found any break, in fact it's more responsive now. I tested for general use cases suiting to my use, it might or might not be enough for your Samsung device, but it can be a starting point.    1. com.android.chrome    2. com.aura.oobe.samsung    3. com.facebook.appmanager    4. com.facebook.services    5. com.facebook.system    6. com.google.android.apps.accessibility.voiceaccess    7. com.google.android.apps.restore    8. com.google.android.apps.tachyon    9. com.google.android.gm    10. com.google.android.healthconnect.controller    11. com.google.android.printservice.recommendation    12. com.google.android.projection.gearhead    13. com.microsoft.skydrive    14. com.mygalaxy    15. com.opera.max.oem    16. com.osp.app.signin    17. com.samsung.SMT    18. com.samsung.android.accessibility.talkback    19. com.samsung.android.alive.service    20. com.samsung.android.app.clockpack    21. com.samsung.android.app.contacts    22. com.samsung.android.app.omcagent    23. com.samsung.android.app.reminder    24. com.samsung.android.app.routines    25. com.samsung.android.app.sharelive    26. com.samsung.android.app.spage    27. com.samsung.android.app.updatecenter    28. com.samsung.android.app.watchmanagerstub    29. com.samsung.android.aremoji    30. com.samsung.android.aremojieditor    31. com.samsung.android.aware.service    32. com.samsung.android.calendar    33. com.samsung.android.easysetuP    34. com.samsung.android.fmm    35. com.samsung.android.game.gamehome    36. com.samsung.android.game.gametools    37. com.samsung.android.gru    38. com.samsung.android.ipsgeofence    39. com.samsung.android.kidsinstaller    40. com.samsung.android.mapsagent    41. com.samsung.android.mdecservice    42. com.samsung.android.mdx.kit    43. com.samsung.android.messaging    44. com.samsung.android.mfi    45. com.samsung.android.mobileservice    46. com.samsung.android.rubin.app    47. com.samsung.android.scloud    48. com.samsung.android.scpm    49. com.samsung.android.scs    50. com.samsung.android.smartcallprovider    51. com.samsung.android.spaymini    52. com.samsung.android.themecenter    53. com.samsung.android.themestore    54. com.samsung.android.uds    55. com.samsung.ecomm.global.in    56. com.samsung.gpuwatchapp    57. com.sec.android.app.SecSetupWizard    58. com.sec.android.app.billing    59. com.sec.android.app.clockpackage    60. com.sec.android.app.fm    61. com.sec.android.app.quicktool    62. com.sec.android.app.samsungapps    63. com.sec.android.daemonapp    64. com.sec.android.easyMover    65. com.sec.android.easyMover.Agent    66. com.sec.android.mimage.avatarstickers    67. com.sec.android.widgetapp.webmanual    68. com.sec.enterprise.knox.cloudmdm.smdms    69. com.sec.location.nsflp2Hope this is helpful."},"179":{"post_title":"Here’s a look at Priority Modes in Android 16, a better version of Do Not Disturb","self_text":""},"180":{"post_title":"Apple will support RCS with iOS 18, improving messaging experience between iPhone and Android","self_text":""},"181":{"post_title":"RCS is now running on iphones with IOS 18 beta","self_text":"IOS 18 beta is now available to apple users which adds support for RCS messaging. Me and my friends now have a working group chat with replies, typing indicators, reactions, everything! I think it's only for certain carriers for the US possibly restricted to California. I will link the link in the comments my friend used to get the update, send it to your apple friends and enjoy the end of the blue bubbles debate! Edit: I am aware it doesn't change the color of the bubbles, but I think most iPhone users find that aspect dull in comparison to the actual functionality of the green messages (which was the problem)."},"182":{"post_title":"Snapdragon 8s Gen 3: Qualcomm confirms March 18 launch event for new \"Snapdragon flagship\" chipset","self_text":""},"183":{"post_title":"PSA: iOS 18’s RCS support will show all users in a group text if you change the name of the group on your Android phone now ","self_text":"I’m an iPhone user but have a few group texts with Android users. My father in law changed the name of the one he is in on his phone and didn’t know it would change on all of ours as well because it never has before lolLuckily it was just a normal name but I can see this being an issue for some people."},"184":{"post_title":"OnePlus Watch 3 Set to Launch on February 18 in North America and Europe","self_text":"(*For some reason, OnePlus hasn't published this press release anywhere, so I'm pasting what they sent me via email in its entirety here.*)  ---  *Offered in two striking colors – Emerald Titanium and Obsidian Titanium – it maintains its industry leading 16-day battery life*  **New York, February 10** – Global technology brand OnePlus today announced the upcoming launch of its latest premium flagship smartwatch -- OnePlus Watch 3. With a focus on seamlessly integrating cutting-edge sensors, industry-leading battery life and advanced health algorithms into an elegant design, OnePlus Watch 3 is set to launch in the United States, Canada, and European markets on February 18.  **Unrivaled Battery Performance** OnePlus Watch 3 is designed to support a demanding lifestyle. It continues to deliver industry-leading battery life with an exceptional 16-day use in power saver mode, 5-day use (up to 120 hours) in smart mode, and features an incredibly fast 10-minute charge that powers the watch for a full day of use. The smartwatch utilizes two distinct flagship chipsets – the **Snapdragon® W5** performance chipset and the new **BES2800 MCU** Efficiency chipset. These chipsets power OnePlus Watch 3's **Dual-Engine Architecture** and ensure an optimal balance between long battery life and intelligent functionality. To increase power efficiency, the fabrication technique of the BES2800 chipset improved and is built on advanced 6nm FinFET. Additionally, it is equipped with the OnePlus Silicon NanoStack Battery, the same technology used in the latest flagship smartphone, the OnePlus 13, which significantly boosts energy density for long-lasting power within a slim design. The battery capacity of OnePlus Watch 3 increased to **631mAh** from 500mAh in the previous edition. Not only has OnePlus increased OnePlus Watch 3’s operational speed, it also dramatically reduced power consumption.   Moreover, an optimized antenna for better power usage, and comprehensive WearOS optimization contribute to the OnePlus Watch 3's superior performance.**Technology Meets Elegance: Classic, Premium and Durable Design**  Designed with a sophisticated, high-end finish, OnePlus Watch 3 keeps the iconic stainless steel casing from its previous model. A sleek, newly introduced titanium alloy bezel with a robust PVD coating enhances its elegance, while ensuring exceptional durability for daily use. The 2D Sapphire Crystal display not only delivers a brighter screen but also boasts impressive strength and longevity.OnePlus Watch 3 will be available in two stunning colors -- Emerald Titanium and Obsidian Titanium. The Emerald Titanium watch features a silver titanium bezel and a stainless steel body, as well as a green fluororubber strap with a stainless steel buckle. This distinctive Emerald Titanium finish, which was inspired by nature, exhibits the ideal balance of dynamic athleticism, signifying development and energy.The Obsidian model features a black titanium bezel and a stainless steel body, as well as a black fluororubber strap with a stainless steel buckle. This exquisite design is the perfect fusion of modern technology and understated elegance.Further details of OnePlus Watch 3 will be revealed at launch, on February 18. Stay tuned for an insightful launch video with industry experts, which will be hosted on the official [OnePlus Europe YouTube channel.](https:\/\/www.youtube.com\/@OnePlus_Europe\/videos)**Disclaimers:*** Actual battery life varies depending on the features and apps used, frequency of calls and messages, number of times charged, and many other factors.* The 120 hours battery life claim is based on tests performed by OnePlus in laboratory conditions. Test data is derived from simulations based on the following settings and usage scenarios, actual battery life may vary    * Using an official watch face, AOD off, default health monitoring.    * Bluetooth connection - 14.2 hours\/day    * WiFi connection standby - 1 hour\/day    * Sleep monitoring - 6.5 hours\/day    * Raise wrist to light up screen - 220 times\/day    * Receive 130 messages\/day    * Screen operation (various applications) - 20min\/day    * Incoming call reminder 5s - 6 times\/day    * Bluetooth call - 5mins\/day    * Sync data between phone and watch - 500\/day    * Bluetooth + headset for music (Spotify) - 15mins\/day    * Outdoor running w\/GPS 30mins\/day    * Alarm 3 times\/day  * The 72 hour Heavy Use battery claim is based on the following usage scenario:      * Third-party watch face (Dual Engine Architecture is off), AOD is turned on, default health monitoring.    * Bluetooth connection + AOD standby - 12.2 hours\/day    * Wifi connection + AOD standby 2 hours\/day    * Sleep monitoring - 6.5 hours\/day    * Raise wrist to light up the screen 300 times\/day    * Receive 180 messages\/day    * Screen operation (using various applications) 30min\/day    * Incoming call reminder 5s\/6 times\/day    * Bluetooth call 5mins\/day    * Google Maps linked navigation 15 minutes\/day    * Synchronize data with mobile phone and watch 500s\/day    * Bluetooth headset connection to listen to music (Spotify) - 30mins\/day    * Outdoor running 30mins\/day    * Alarm 3 times\/day   * Power Saver Mode battery claim is based on the following usage model    * All day Bluetooth connection;    * 90 minutes of outdoor exercise\/week;    * Raise wrist to wake screen - 180 times\/day;    * 180 messages\/day;    * 5 incoming calls\/day;    * 5 minutes\/day of Bluetooth calls;    * 3 alarms\/day;    * Sleep detection - 6h\/day  * Charging speed: Base on the charging test in ambient temperature"},"185":{"post_title":"Pebble cements its smartwatch legacy as Google shares source code with the community","self_text":""},"186":{"post_title":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates","self_text":"The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov"},"187":{"post_title":"Google is preparing to bring this iOS 18 feature (Vehicle Motion Cues) to Android (APK teardown)","self_text":""},"188":{"post_title":"India Smartphone Market Volume up 8% YoY, Value up 18% YoY in Q1 2024; vivo Leads in Volume, Samsung in Value","self_text":""},"189":{"post_title":"Sunsetting LineageOS 18.1","self_text":""}}}