{"sentiment":{"0":"negative","1":"negative","2":"negative","3":"negative","4":"negative","5":"negative","6":"negative","7":"negative","8":"negative","9":"negative","10":"negative","11":"negative","12":"negative","13":"negative","14":"negative","15":"negative","16":"negative","17":"negative","18":"negative","19":"negative","20":"negative","21":"negative","22":"negative","23":"negative","24":"negative","25":"negative","26":"negative","27":"negative","28":"negative","29":"negative","30":"negative","31":"negative","32":"negative","33":"negative","34":"negative","35":"negative","36":"negative","37":"negative","38":"negative","39":"negative","40":"negative","41":"negative","42":"negative","43":"negative","44":"negative","45":"negative","46":"negative","47":"negative","48":"negative","49":"negative","50":"negative","51":"negative"},"categories":{"0":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"1":[" User Experience, Service"],"2":[" Audio Issues, User Experience, Others"],"3":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"4":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"5":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"6":[" Audio Issues, User Experience, Others"],"7":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"8":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"9":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"10":[" Audio Issues, Bluetooth"],"11":[" Audio Issues, User Experience, Others, Technical, Call drop"],"12":[" Audio Issues, User Experience, Service, Support, Others, Technical, Voice Quality"],"13":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop, None"],"14":[" Audio Issues, User Experience, Support, Others"],"15":[" User Experience, Service, Support, Others"],"16":[" User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"17":[" User Experience, Others, Technical"],"18":[" Audio Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"19":[" User Experience, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"20":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"21":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"22":[" User Experience, Service, Others, Technical, Email Notifications"],"23":[" Screen Recording Error, User Experience, Technical, Others"],"24":[" User Experience, Others, Technical"],"25":[" Audio Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"26":[" Audio Issues, User Experience, Service, Support, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"27":[" User Experience, Others, Technical, Call drop"],"28":[" Audio Issues, User Experience"],"29":[" User Experience, Service, Others, Technical"],"30":[" User Experience, Service, Support, Technical, Call drop"],"31":[" User Experience, Reboots, Software Malfunction"],"32":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"33":[" User Experience, Others, Technical"],"34":[" Audio Issues, User Experience, Service, Others, Technical"],"35":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"36":[" User Experience, Service, Others, Technical"],"37":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"38":[" Audio Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"39":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"40":[" Audio Issues, User Experience, Others"],"41":[" Audio Issues, User Experience, Service, Support, Others, Technical, Call drop"],"42":[" Audio Issues, Bluetooth"],"43":[" Video Issues, User Experience, Service, Support, Others, Technical, None"],"44":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"45":[" User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"46":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"47":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"48":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"49":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"50":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"],"51":[" Audio Issues, Video Issues, User Experience, Service, Support, Others, Technical, Voice Quality, Bluetooth, WiFi, Call drop"]},"user_review":{"0":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","1":"Pixel 8 intermittent green screen help+Hello, I need some advice. The linked picture is representative of the issue I've ran into a few times now. I read up about a screen grounding issue that Google has recognized and issued an extended warranty for. My phone does qualify for this. I went to a local repair shop and got a different story. When I was at the repair shop the screen was not messing up. The repair tech said that he suspected it was water damage and if he investigated further he'd likely destroy my screen and it would either be covered by warranty or is owe him 250$ for a new screen. Needless to say I walked out without any destructive troubleshooting by him. Any input on what's going on? Thanks!","2":"I'm a complete idiot\/ Pixel 9 Pro XL+This is the most embarrassing thing I've ever done. Today I wanted to add a physical second SIM card to my existing eSim. I don't know why, I probably shouldn't done this in the middle of playing Dead Island 2 on my PS5 , but I confused the SIM tray slot with the speaker on the right. I was trying for probably 5 minutes to insert the SIM into the speaker, tuning the SIM around multiple times and asking myself why this was so hard. After around 5 minutes I figured out that it was in fact the speaker and not the SIM slot, obviously I fucked up big time until then.It looks like I destroyed the net in front of the speaker, the speaker itself is fine I thing.My question: what's the consequences of my stupidity? My 4 day old Pixel 9 is probably not waterproof anymore but should I be worried about something else? Sorry for everyone that had to read through that stupid story.","3":"Pixel 8 users, how's it going?+My Pixel 5A just died (as in I was using it and it instantaneously turned into a useless chunk of plastic and rare earth metals), and I'm looking at buying an 8 as a replacement. I'm looking for some long-term reviews or testimonials - I hate replacing my technology so want my next phone to last a bit longer than the 5A has.","4":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","5":"Pixel 9 series price increase would've been better received if they had bumped up the base storage to 256 GB+A lot of people seem unhappy about the price increases of the Pixel 9 phones, and rightfully so. The spec upgrades from the 8 series are few, and this is the second consecutive year of a price increase, coming off the tail of the Pixel 8. Not to mention the fact that having 128 GB of storage in a 2024 flagship phone is somewhat contentious, since most Androids in this price class have 256 GB as the minimum.","6":"I'm a complete idiot\/ Pixel 9 Pro XL+This is the most embarrassing thing I've ever done. Today I wanted to add a physical second SIM card to my existing eSim. I don't know why, I probably shouldn't done this in the middle of playing Dead Island 2 on my PS5 , but I confused the SIM tray slot with the speaker on the right. I was trying for probably 5 minutes to insert the SIM into the speaker, tuning the SIM around multiple times and asking myself why this was so hard. After around 5 minutes I figured out that it was in fact the speaker and not the SIM slot, obviously I fucked up big time until then.It looks like I destroyed the net in front of the speaker, the speaker itself is fine I thing.My question: what's the consequences of my stupidity? My 4 day old Pixel 9 is probably not waterproof anymore but should I be worried about something else? Sorry for everyone that had to read through that stupid story.","7":"Just switched from an iPhone to the Pixel 9 Pro XL+After years of being deep in the Apple ecosystem I made the switch to a Pixel. It was a little easier once my MacBook usage fell off after college and I started using my Apple Watch as a Fitbit basically. ","8":"Dropped my pixel 8 in the toilet. +I know that the Google pixel 8 is water resistant but I've also seen things about on here about the insides of the phone corroding. I left it off for around an hour. It was fully submerged for less than a minute, although I am still worried. Anything that I should do? Thank you. ","9":"I can confidently say the Google pixel 8 is the worst phone I've owned+The worst part, there isn't a major issue it's just a million small things. It all started with not being able to press the red end call button. The painstakingly slow light up from pulling your phone out of your pocket. Just a few months in the speaker begins cracking. Overheating, scrolling frame rate drop, camera app crashing. Sometimes I think the fingerprint scanner just doesn't want to work some days. And a million other things people have searched on Google forms. If anything do not buy a pixel 8. I'll give it one thing. I like the camera when it works and the Google edits. ","10":"Android Auto won't connect with Android 15, Pixel 9 phones+Posted in the Google Support forum, may as well try here too...My wife and I both have Pixel 9 phones. We just arrived in the US from Canada for a vacation and are completely unable to connect our phones with Android Auto to rental cars. We have tried 4 different rental cars, 3 brands (Ford, Nissan, and Dodge), and BOTH of our phones. We can pair our phones to the cars, but Android Auto does NOT work - either over Bluetooth or wired. My phone was connected via Android Auto to my BWM i4 at home before the Android 15 update, and was still working afterwards. My wife has a Tesla, so her phone has never been used with Android Auto since the update or before. I have tried over and over, with Bluetooth on and off. I just had to go and buy a windshield mount for our phones as we can't use the vehicle screens. Not ideal when we spent so much on new phones. Does ANYONE have a solution or any ideas? I have tried resetting Bluetooth, removing all connected Android Auto vehicles and trying again and again. When we first arrived last night, my wife's phone worked for an hour or so, long enough to get to our condo, but as of this AM, nothing.","11":"I'm a complete idiot\/ Pixel 9 Pro XL+This is the most embarrassing thing I've ever done. Today I wanted to add a physical second SIM card to my existing eSim. I don't know why, I probably shouldn't done this in the middle of playing Dead Island 2 on my PS5 , but I confused the SIM tray slot with the speaker on the right. I was trying for probably 5 minutes to insert the SIM into the speaker, tuning the SIM around multiple times and asking myself why this was so hard. After around 5 minutes I figured out that it was in fact the speaker and not the SIM slot, obviously I fucked up big time until then.It looks like I destroyed the net in front of the speaker, the speaker itself is fine I thing.My question: what's the consequences of my stupidity? My 4 day old Pixel 9 is probably not waterproof anymore but should I be worried about something else? Sorry for everyone that had to read through that stupid story.","12":"Anyone else lose \"snooze\" and \"stop\" voice command ability for the alarm?+I've noticed in the last week or two I've been unable to use said voice commands. I can't find anything in the options to enable or disable either.I'm on the Jan 5 25 update on my Pixel 9 Pro Fold.","13":"Google Messages YouTube link previews broken? +Are YouTube link previews in Google Messages broken?  I can only see the links on my Pixel 9 Pro XL and Pixel 7. Even went back to older YouTube links in my Google Messages on my Pixel 7 and tapped to download the preview but it eventually says unavailable. All other links i send\/receive have previews. I have the settings 'show all previews' on and 'only download data on Wi-Fi' off. Also force stopped the app and cleared cache but no dice.The people i regularly message are all on iOS and they see the YouTube previews on their end. 🤷‍♂️Update: on 11\/04\/24 my YouTube link previews in Google Messages started working again. ","14":"How do I Get Google to Fix a Problem, or at Least Pay Attention?+The recording functionality of Call Notes at least in Pixel 9 Pro XL is broken - on long calls the audio cannot be played back, and the controls that one would use to play back the audio are grayed out (5 minute call records fine, 55 minute call does not.)I tried the online support chat and the chat rep was less than helpful, to put it mildly.Any suggestions on how to get it escalated so Google can fix it?","15":"Pixel Buds Pro 2 missing+I recorded the opening of the delivery box, it was supposed to have a buds case and the buds themselves. Instead of the buds, there was an 8a. How do I reach out to support? The order status has not updated. Is my google account in any trouble?","16":"Pixel 6 to Pixel 8 or 9? How's the fingerprint sensor+I have the Pixel 6 for years now. I use it as my secondary phone.  Here is the thing. I stopped trying to unlock it with my fingerprint, because it's extremely annoying. So i just input my pin number each time. I got used to this method, since it's my secondary phone, I don't have to unlock it a lot of times, maybe 5-6 times a day to check for my job related emails. Here is my question. Since I still would like to have a fingerprint sensor to unlock, did they fix the fingerprint sensor in the Pixel 8 or the 9? I am hearing conflicting opinions so if it's still an issue, I will be looking for another brand as my next upgrade. ","17":"Pixel 8 Android 15 - Pixel weather not compatible??+Is it just me?Just updated to A15 and Weather app is not available for me.","18":"Pixel Pricing is Going Crazy! +So we are now seeing $150 CAD price increase in Regular Pixel Variant every year. $799 - Pixel 7$949 - Pixel 8$1099 - Pixel 9 The pricing has gone really crazy, I don't want to spend $1099 + tax for a Non-Pro version and that too for a 128GB version. Hell nah!And Why on the hell they released Pixel 9 Pro XL 😑 ","19":"Does the Google Pixel 8a have desktop mode?+Maybe a stupid question, but does the Google Pixel 8a have desktop mode? Gemini's answer was no, but Google says the Google Pixel 8 series and later support desktop mode.","20":"Google Pixel 9 Pro XL and Notifications+Hi everyone,I just got my 9 Pro XL last week.  Still sort of setting it up, it's a work phone for me.Question. Is anyone having issue receiving push notifications for any of their apps, 2fa etc?  Literally none of mine are working.  I have uninstalled reinstalled, deprovisioned and reprovisioned all of my accounts but they are not working.Its been a few years now since I have been away from Android.  Not sure what to make of this.Any advice?Thanks!","21":"Pixel Pricing is Going Crazy! +So we are now seeing $150 CAD price increase in Regular Pixel Variant every year. $799 - Pixel 7$949 - Pixel 8$1099 - Pixel 9 The pricing has gone really crazy, I don't want to spend $1099 + tax for a Non-Pro version and that too for a 128GB version. Hell nah!And Why on the hell they released Pixel 9 Pro XL 😑 ","22":"Why am I not receiving email notifications on a brand new phone, with all email notifications turned on and the system and all apps being up to date? This has happened on multiple brand new Pixel phones, I can't get verification notifications to log into my other apps. Appalling+Bonus question: Why is the vibration so weak and inconsistent on Android 15? The vibration was one of the few things I thought Pixel did well, now it feels gross","23":"Screen Recorder showing \"error saving screen recording\" message on Pixel 8, cannot find recording anywhere? +For some strange reason, on my Pixel 8 running the lastest Android 15, whenever I hit \"stop\" on a screen recording, a \"processing screen recording\" notification pops up briefly, before disappearing automatically and returning a bubble at the bottom of the screen saying \"error saving screen recording\".   I've tried rebooting, updating, but to no avail. I have managed to take one screen recording in the past, and it was saved in the \"Movies\" folder under Google Photos, but somehow I cannot seem to take them anymore now?Anyone have the same issue or have a fix? ","24":"Bought the Pixel 8 Pro recently and I'm a bit disappointed with the camera! The previous interface was so much better, mainly the brightness & contrast slider! That gave enough control for the photo to not be processed by the algorithm! Any alternatives?+It was a simple tap, slide and click scenario before! It captured the photo as is but now it's just disappointing as the night sight is applied even when I don't want it or something similar! I want that control back!Are others experience the same disappointment or is it just me? :(","25":"Galaxy Watch7 Manager is setting DND on my Google Pixel 9 Pro and not removing it.+Not sure what is triggering the event.  I have no Modes set on the watch.  All of a sudden I am missing calls and other notifications.  The Watch itself is NOT in DND mode.  Toggling DND on the watch does not effect the phone.  I have combed through all of the Wear settings and can't find a single thing that is controlling it.  Screenshots show that it's the Watch7 Manager doing it.  Nothing in the permissions for the app seem to let me disable its ability to set DND.   Any help would be appreciated.https:\/\/imgur.com\/a\/FJQ1Jzt","26":"Google Home Notifications Not Showing on Pixel 9 Pro XL+I hate to ask a potentially dumb question, but could use some help here.I have notifications on for the Google Home Nest cameras whenever someone rings the bell, leaves a package, passes by, etc. But ever since upgrading from my 6 to the 9 Pro XL, I'm no longer getting those notifications on the new phone.I've checked all my settings, and as far as I can tell, everything is set up properly.Am I missing something here? Is it because Gemini is now set as the default assistant as opposed to the regular assistant?Any help with this is much appreciated. Thanks in advance!","27":"Why is no one talking about how useless Find My Device is?+I mean, even tho it gives me a toast message each time i turn off my Pixel 8 Pro that i can locate it anyway, it doesnt, this bullshit gets useless in the very moment you get disconnected from internet. If your phone gets stolen and the guy just turns it off or takes out the sim, its gone. Literally 0 competition with Apple's Find my. What's that hard to make at least something work properly? If you copy a feature at least copy it properly, not even talking abt making it better.","28":"Tried everything, can't make WA voice message play in the background on pixel 8+I am getting crazy with that phone. I try now for several months everything in the book to let WhatsApp play voice messages in the background. Sometimes it works for some time. Then it stops when the screen goes off.Or it stops when I move to another app, for instance I opened Reddit and soon later it stops. It might even stop for a few seconds only and then go on again by itself for few seconds. It's completely random It seems I need a second phone or the computer just to listen to longer voice messages. Used to have Samsung, not once in my life did I have this problem with all the 10 Android phones I had so far","29":"Problem texting on Pixel 8 in Google Messages - International numbers? +I have a Google Pixel 8. I can't send texts to a group in Google Messages that has members in the US; I am in Canada. The group has 19 members. I can receive texts but not send. Should I be setting up the phone numbers in my contacts in any specific way? ie. +1-312-999-9999 or just 312-999-9999? Neither my carrier or Google Help seem to know why I can't send messages to this group. This is driving me crazy as it is my family and I can't communicate with them as a group. Some of them do have I-phones, but one other person has a Google Pixel 8 also and he doesn't have problems. ","30":"Worst Experience With Google Pixel 8 Return - Never buying any google pixel phone again+First off I apologize if this is the wrong sub for this or if this breaks any rules. I tried to check but I didn't see any this post would offend. My Google Pixel 8 started have display issues in December, I sat on sending it in for repair due to the holidays and the fact that I'm on call for work about 4 times a week. My issues started with edges of screen getting really green and turned into a solid green line up and down the phone. I sent it in for a replacement and it arrived on 01\/13\/25, I waited for them to receive it and send me a new phone for 4 business days before I contacted support. They said that they were on it and to wait 24-48 hours and I'd be sent a new phone. I waited the two business days and nothing changed at all. I then contacted support again and tried to get someone to help me (Now a week without my phone) but was told the same thing again that it would take 24-48 hours for a different team to look into it. When I protested and said that I couldn't be without my phone for much longer, that I'm required to be on call at work, they said \"Sorry that's all I can do\". When I asked to speak to a higher level up I was told \"You're going to get the same answer out of them\". So that's it I'll never buy a google phone again. Not that google will probably care much, or that anybody really cares. Its just that this whole experience has been INCREDIBLY frustrating for me so I feel like I have to do something. Sorry if this was a waste of reading time. ","31":"Pixel 9 Pro Fold - Reboots but not reboots?+Hello,After my phone discharged last night I'm having some weird issues today. My phone will do like a \"fake\" reboot. It disconnects from everything, my samrt watch tells me the phone disconnect for about a second, it becomes unresponsives, and then wakes up and says \"Pin required are device restart\" &nbsp;The problem is, it doesn't restart. The screen flashes to pitch black for less than a second, and then lock screen appears. In the Settings > About Phone uptime is currently 14 minutes, but it happened less than 3 minutes ago and has happened at least 8 times since I woke up 2 hours ago. &nbsp;I've tried \"real\" poweroff and reboots several times.Anyone else had anything similar?&nbsp;**UPDATE:**&nbsp;Didn't see this reply until now when I went back to update the post. &nbsp;For anyone here in the future: I returned my fold and went back to my Pixel 8 Pro - Which I then dropped a week ago and ended up with a Pixel 9 Pro XL.&nbsp;When I copied data and apps from the Pixel 8 to the 9, I got the exact same issue. I ended up factory resetting and simply installed all my apps manually. I took 4 hours, but no problems after that. Must be some app that transfered between phones that ended up crashing\/bricking the system.","32":"Just switched from an iPhone to the Pixel 9 Pro XL+After years of being deep in the Apple ecosystem I made the switch to a Pixel. It was a little easier once my MacBook usage fell off after college and I started using my Apple Watch as a Fitbit basically. ","33":"Just moved from the iPhone 15 pro to pixel 8 pro and I hate the black bar at the bottom. How is no one talking about this? +https:\/\/ibb.co\/GWqgRVGI am an avid firefox user and browse a lot on the phone. This black bar is so ugly. It's even on chrome. So much of screen real estate is wasted because of this","34":"Buyer Beware: The Official Google Phone Cases will not protect your Pixel 9 Pro XL+My phone fell out of my pocket hit the pavement on the corner and cracked the phone case, the screen protector and the screen in the corner. $40 down the drain. ","35":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","36":"Why is no one talking about how useless Find My Device is?+I mean, even tho it gives me a toast message each time i turn off my Pixel 8 Pro that i can locate it anyway, it doesnt, this bullshit gets useless in the very moment you get disconnected from internet. If your phone gets stolen and the guy just turns it off or takes out the sim, its gone. Literally 0 competition with Apple's Find my. What's that hard to make at least something work properly? If you copy a feature at least copy it properly, not even talking abt making it better.","37":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","38":"Google Home Notifications Not Showing on Pixel 9 Pro XL+I hate to ask a potentially dumb question, but could use some help here.I have notifications on for the Google Home Nest cameras whenever someone rings the bell, leaves a package, passes by, etc. But ever since upgrading from my 6 to the 9 Pro XL, I'm no longer getting those notifications on the new phone.I've checked all my settings, and as far as I can tell, everything is set up properly.Am I missing something here? Is it because Gemini is now set as the default assistant as opposed to the regular assistant?Any help with this is much appreciated. Thanks in advance!","39":"Call recording on Google Pixel 9 Pro XL+Hi, I bought a 9 Pro XL (Japan variant) and has been with me for almost a month now but I can't seem to find the record button while there is a call. I used to have this option in my previous android phone of another brand. Is there a way to tweak it on the settings? ","40":"Google pixel 9 pro Call screen missing feature +Missing feature for Call screen does someone have the same issue? I have the option but I can only change the voices","41":"Pixel 9 Pro Fold not vibrating for incoming calls+I've googled this a lot and haven't found a solution that works for me. My P9PF does not vibrate when receiving an incoming call. However, it does vibrate for other notifications. Things I have checked: - do not disturb is off - ringer is set to \"vibrate\" in the volume toggle - ring vibration is enabled and set to the max - I have restarted my phone and reset my app preferencesDoes anyone have any thoughts or suggestions on what may be causing this or how to fix it? ","42":"Google Streamer + Google Buds Pro 2 + Google Pixel 9 Fold+Has anyone tried to stream anything Netflix, YouTube on Google Streamer while listening on Google Buds Pro 2 when Google Pixel 9 Fold?I am getting random audio distortion while nothing on all my Nothing Ear (a) or any other Nothing headphones.","43":"Need help!! Damaged phone!!Does Google Pixel 8 support video out (via USB-C\/HDMI)? I need this to get my pictures\/data out+Hi, I need some help! My phone screen is damaged, and the bottom half doesn't work anymore. Backup stopped a few months ago (due to me procrastinating cleaning up my google cloud). I'm trying to pull off some pictures from my vacation with my family from my pixel 8. I'm seeing conflicting reports on Reddit about whether video out via USB-C\/HDMI hub works for the pixel 8 and was hoping someone knows\/can test it out.","44":"Pixel 9 series price increase would've been better received if they had bumped up the base storage to 256 GB+A lot of people seem unhappy about the price increases of the Pixel 9 phones, and rightfully so. The spec upgrades from the 8 series are few, and this is the second consecutive year of a price increase, coming off the tail of the Pixel 8. Not to mention the fact that having 128 GB of storage in a 2024 flagship phone is somewhat contentious, since most Androids in this price class have 256 GB as the minimum.","45":"Pixel 6 to Pixel 8 or 9? How's the fingerprint sensor+I have the Pixel 6 for years now. I use it as my secondary phone.  Here is the thing. I stopped trying to unlock it with my fingerprint, because it's extremely annoying. So i just input my pin number each time. I got used to this method, since it's my secondary phone, I don't have to unlock it a lot of times, maybe 5-6 times a day to check for my job related emails. Here is my question. Since I still would like to have a fingerprint sensor to unlock, did they fix the fingerprint sensor in the Pixel 8 or the 9? I am hearing conflicting opinions so if it's still an issue, I will be looking for another brand as my next upgrade. ","46":"Just switched from an iPhone to the Pixel 9 Pro XL+After years of being deep in the Apple ecosystem I made the switch to a Pixel. It was a little easier once my MacBook usage fell off after college and I started using my Apple Watch as a Fitbit basically. ","47":"Would you rather have pixel 10 pro XL, s25U or one plus 13 for the next 3 years. 2025 flagship choices+Out of the 3 I'd probably go for pixel 10 pro XL due to the software and design\/ user friendly interface of the phone because I dont game on my phone How about you?","48":"Would you rather have pixel 10 pro XL, s25U or one plus 13 for the next 3 years. 2025 flagship choices+Out of the 3 I'd probably go for pixel 10 pro XL due to the software and design\/ user friendly interface of the phone because I dont game on my phone How about you?","49":"Finally got a Desktop Mode working!!+Thanks to the new version of scrcpy and Android 15! Can now have Phone Screen Off and Tablet Mode enabled!      Steps:  Download version 3.x from here: [https:\/\/github.com\/Genymobile\/scrcpy](https:\/\/github.com\/Genymobile\/scrcpy)    Turn on Developer Settings  Turn on USB Debugging  Enable Force activiteis to be resizable (Lets you drag the corner of apps to change size)  Enable Freeform windows (Lets you move the apps around the screen)  Enable Freeform Windows on Secondary Display  Enable non-resizable in Multi-Window (I'm using a secondary display from my Pixel 8 - though some might want to mirror.)    Reboot.    Plug phone in to PC - Accept the USB Debug AUTH prompt. (You can of course do this with wireless ADB as well though expect lag).  Open up a command prompt where you extracted SCRCPY too and run this command.      scrcpy --new-display=2560x1200\/120    Change resolution to what you like. The \/120 is the DPI. Use a low DPI for Tablet mode.    This will then create a secondary display from your phone (you can still use your phone as well!) or you can just leave the phone screen off!    I have been waiting for this day for years! Only thing missing is a taskbar though other phones may work there is no nice taskbar on my Pixel 8 Pro.    You can also play around with codecs and framerate if you like with parameters like    \\--video-codec=h265  \\--max-fps=60  \\--video-codec=av1    Hope this helps some people!","50":"The Pixel Launcher is starting to roll out a new \"search engine\" settings page+This page lets you change the search provider used for the search bar on the home screen.One user tells me they received a notification from the Search Engine Selector app to choose their search engine. After changing the search provider, the search bar's icon is updated to reflect the user's choice of provider. The user can go to the Pixel Launcher's settings then tap \"home screen search settings\" and finally \"search engine\" to change the search provider afterwards.This is starting to roll out to users in Europe and comes as the DMA recently went into effect. Google announced last week that users in the EEA will see \"additional choice screens\" including one for selecting a default search engine when setting up a new Android device.Here are some screenshots: [1](https:\/\/pbs.twimg.com\/media\/GIvIx-GWIAA10v3?format=jpg&name=large) [2](https:\/\/pbs.twimg.com\/media\/GIvIzCvWkAAEM47?format=jpg&name=large) [3](https:\/\/pbs.twimg.com\/media\/GIvI0cuWEAAunRb?format=jpg&name=large) [4](https:\/\/pbs.twimg.com\/media\/GIvI2m4X0AAVsrl?format=jpg&name=large)","51":"Finally got a Desktop Mode working!!+Thanks to the new version of scrcpy and Android 15! Can now have Phone Screen Off and Tablet Mode enabled!      Steps:  Download version 3.x from here: [https:\/\/github.com\/Genymobile\/scrcpy](https:\/\/github.com\/Genymobile\/scrcpy)    Turn on Developer Settings  Turn on USB Debugging  Enable Force activiteis to be resizable (Lets you drag the corner of apps to change size)  Enable Freeform windows (Lets you move the apps around the screen)  Enable Freeform Windows on Secondary Display  Enable non-resizable in Multi-Window (I'm using a secondary display from my Pixel 8 - though some might want to mirror.)    Reboot.    Plug phone in to PC - Accept the USB Debug AUTH prompt. (You can of course do this with wireless ADB as well though expect lag).  Open up a command prompt where you extracted SCRCPY too and run this command.      scrcpy --new-display=2560x1200\/120    Change resolution to what you like. The \/120 is the DPI. Use a low DPI for Tablet mode.    This will then create a secondary display from your phone (you can still use your phone as well!) or you can just leave the phone screen off!    I have been waiting for this day for years! Only thing missing is a taskbar though other phones may work there is no nice taskbar on my Pixel 8 Pro.    You can also play around with codecs and framerate if you like with parameters like    \\--video-codec=h265  \\--max-fps=60  \\--video-codec=av1    Hope this helps some people!"}}