{"0":{"0":"Any advantage of using pixel buds with pixel instead of other bluetooth earbuds?+I’ll buy a Pixel 8 soon, but I currently use an iPhone 12 and AirPods Pro and I love how everything connects instantly. I just want to know if I’ll have this same experience using pixel buds on google pixel, or if I can continue using my airpods without missing on anything.","1":"Google Pixel Pro Buds 2 - Sound delay? +I just received my Pixel Buds Pro 2 today and have been testing them out. I was really excited to pair them with my Pixel 9 Pro XL, expecting a smooth experience given they're both G.\n\nHowever, I've noticed a significant sound delay—ranging from 0.5 to 1 full second in some cases. The first instance was with the keyboard feedback sound; after I’d stopped typing, the audio was still lagging behind. It became really apparent when I realised the sound upon hitting each key was delayed by a noticeable amount.\n\nI tested an audio latency video on YouTube, and it seemed okay. YouTube Music plays fine, and apps like Algoriddim's Djay are also working without delay. But when I try any game from the Play Store, the lag is unbearable—around 0.8 seconds or more, even in simple games like Royal Match. There are noticable delays with social media posts that include audio Facebook\/Instagram\/X \n\nI was expecting much better from a flagship device paired with Google’s premium earbuds. Has anyone else encountered this issue?\n\nI have seen a few articles regarding latency but they all seem to be from 2022\n\nFor context:\n\nBoth the buds and phone are fully charged.\n\nThe buds are on the latest firmware.\n\nNo other Bluetooth devices are connected.\n\nMy phone doesn’t have a case, and there’s no apparent interference.\n\n\nAny help or suggestions would be appreciated!","2":"Your Google Pixel 9 is getting a free audio upgrade - and it can't come soon enough+Bluetooth LE audio support opens up more ways to listen to your Auracast-enabled hearing aids, earbuds, headphones, and speakers.","3":"Google Buds Pro 2 sensor on left earbud not working+Hello,\n\nRecently, my wife gifted me Google Pixel Buds Pro 2 for my birthday. I was very excited about the gift, but after unboxing, I discovered that the left earbud doesn’t produce any sound. The right earbud works fine, but when I try to adjust the ear tips, the app shows that only the right earbud is inserted and continuously prompts me to insert the left one.\n\nAdditionally, I noticed that the volume can only be adjusted through the right earbud using the touch sensor, while the left earbud’s touch sensor doesn’t respond at all, even though it still produces sound.\n\nI contacted Google Support and followed their recommendations, but it didn’t resolve the issue. Together with technical support, we concluded that the left earbud needs to be replaced. However, there is a problem: I live in Ukraine, where there is an ongoing war, and the borders are closed, so it’s impossible to travel for an exchange.\n\nI requested that Google send me a replacement left earbud under warranty, but they refused. The consultants insist that I send the earbuds to a friend in Poland or the Czech Republic, and only in that case will they be able to process the exchange. However, all of my friends are currently serving in the Ukrainian Armed Forces, and I have no one to turn to.\n\nI would appreciate your guidance on how to resolve this situation. Is there any chance that Google would be willing to send me a replacement left earbud in Ukraine?\n\nThank you in advance for your assistance.","4":"AirPods on the Google Pixel+Hey all very first post on this Sub! So I’ve been a Apple user for years and years now but with my Bell phone plan coming to a end I’ve received a very good phone plan from Telus with the Google Pixel 9 that I really can’t say no to. So with my upcoming switch to the Google Pixel my question is how do the Apple AirPods specifically the 4th gen ones work with the Google pixel? I understand I won’t have some features but what I’m mostly after is the ability to click for the next\/previous song and answering calls as that’s all I care to have. I want to stick with the AirPods as most suction cup style earbuds don’t fit properly in my ears so the Google buds are a no go unfortunately. Or if there’s something else similar to the apple earbud style I’m open to other suggestions aswell. Thanks in advance!","5":"Google pixel buds 2 pro with pixel 7 pro | while buds are connected to the phone changing volume changes volume of just one earbud+Since the latest update to pixel 7 pro (Android 15 with December 2024 security), I have been experiencing that on changing the volume once connected to pixel buds 2 pro only changes  the volume of one earbud (either left or right, changes everytime).\n\n  \nConnecting these on windows laptop works correctly.\n\n  \nIs anyone else experiencing the same. Please let me know if you know the solution to resolve it.\n\n  \nThanks in advance!!","6":"How often do Google Pixel Buds Pro go on sale?+Planning to get a pair of google pixel buds pro for my pixel 6. Its at full price right now I do recall sometimes they do do sales. I was just wondering how often they do it and if I should just wait until the next sale. The earbuds I have right now work fine but they are slowly falling apart (literally had to superglue the casing).","7":"Wireless earbuds for Pixel 7 advice+My bf has Google Pixel 7 and I want to gift him wireless earbuds for Christmas as he is always stealing my airpods, are google pixel buds a better option for his phone? Is it worth buying pixel buds pro 2 version? He is more into the quality of music, may talk on the phone with them. Are they good or are there better options?\nAppreciate all answers ","8":"Linkbuds S or Google Pixel Buds Pro 2+TL;DR: main concerns are latency, one buds controls, good multipoint support and sound quality. Help me decide please. And thank you in advance\n\nI'm having a hard time deciding between these two.  My only previous experience with earbuds are Pixel A series which felt fine but over prolonged use (an hour or 2) they seem to back themselves out of my ear. I was then gifted Samsung Buds2 Pro but they don't work well with google Assistant on my Pixel 9 and they have connection issues (muffled assistant, don't chime when assistant is active, don't automatically connect sometimes) and I see it's kind of just common for those earbuds to be a poor user experience.\n\nThe only few things holding me back from just throwing down on the pixel buds are if they'll just back out of my ears like the A series did, the sound quality, and paying that extra 50 dollars for better one earbud convenience.\n\n","9":"Google pixel buds a reset button is broken+Hey everyone, my pixel earbuds work just fine connecting to my phone or my computer. They also charge and do everything okay. I can no longer connect them to a new device like the new work computer I just got because the physical button getting held does not initiate pairing mode. It doesn't initiate reset mode either. I've already checked to make sure that the earbuds are completely pushed down and everything like that so I think it's physically the hardware button. \n\nAm I correct that if this button breaks you can no longer pay your buds to anything ever again? \n\nLet me know if anyone's had this issue and fixed it - everything I see online tells me to press it firmer or something lol","10":"Google Pixel Buds A-Series worth it?+Is buying the Google Pixel Buds A-Series worth it right now since they're on sale on the G store.  Or does anyone recommend any good earbuds for around that price? ","11":"Google Pixel USB-C Earbuds materials+Hi guys,\n\ndoes it have rubber on the edges. Or does it feel like rubber(soft) and not like plastic?\n\nThanks","12":"Huawei Freebuds 5i - Google Pixel compatibility+Hi, I own a Google Pixel 7a and I recently bought a pair of Huawei Freebuds 5i. Great earbuds, I already had the previous model (4i) but I lost it in a trip.\n\nHowever, I have a few questions:\n\n1. Is there any app that pops up a live widget when opening the case? Similarly to AirPods with AndroPods.\n2. Is there any way to make the phone recognize different batteries for left and right bud and for case? The Huawei AI Life app obviously detects them, but does not provide any widget; the OS sees the buds as a generic bluetooth device, not separating the three batteries. The widget template shows them correctly separated using a pair of Pixel Buds A-Series: [https:\/\/imgur.com\/a\/3MglqMG](https:\/\/imgur.com\/a\/3MglqMG). Is it because they are directly from Google, or do I need to perform some trickery?\n\nThanks in advance.","13":"XS earbud tips for Pixel Buds Pro? +Hello! Does anyone have any good suggestions for XS earbud tips for the Pixel Buds Pro? Currently I use AirPods Pro 2’s cause they actually come with a XS ear tip. While I love them and it’s been perfect, I just really wanna use the Pixel Buds Pro since it’s a more seamless experience and it has Google Assistant built in. It’s just the standard small tips won’t stay in my ears completely. Any suggestions would be appreciated!! Thank you ","14":"Pixel 8a Bluetooth earbuds stuttering+Hey everyone. I bought Pixel 8a from official Google store, and proceeded to connect my earbuds to my new phone... to realize that it stutters like crazy.\n\nI did some digging and I think this is an Android 14 issue and not a hardware issue, although the latest update should have cleared it. I really don't want to send a new phone back for repair...\n\nI tried every solution I could find online, such as resetting wifi and Bluetooth settings, changing some option in developer settings, restarting phone and earbuds, but nothing works.\n\nAlso I should mention that the earbuds are a random Chinese brand but I'm 100% sure the issue is not with them as they perfectly connect to my previous phone and other people's phones.\n\nHas anyone experienced the same issue? Any suggestions?\n\n  \nEDIT: I had an old pair of Redmi dots lying around, and out of curiosity I decided to try them. Lo and behold... it didn't stutter anymore :\/ I guess the issue is with my Chinese no-brand earbuds, but it's just so weird... If anyone else experiences the same issue, consider compatibility issues as well.","15":"6~ish month review for Google Pixel 8 Pro+I just want to leave a usage review since I've daily driven my Pixel 8 Pro for more than 6 months now coming from a Samsung S20 FE. I switched to Pixel mainly because of the free smartwatch that it came with when pre-ordered, but I really preferred to go the Samsung route (more below) so I switched with a big bias. But I think the review is as fair as I can be as a regular not-so-phone-techy user\n\n&#x200B;\n\nPro:  \n1. Camera, I'm not a big picture taker, but I certainly noticed the big difference from my old phone to this  \n2. I do like the UI compared to Samsung and from factory, the phone came with less bloatware (imo) compared to my S20 back then. Though the only thing I would love to change with the UI is the \"buttons\", I miss how I can configure those with Samsung  \n3. Overall, the hardware performs pretty good, I don't game on my phone so I don't really feel the phone \"struggle\" with its workloads  \n4. The phone itself has a really nice feel and one of the biggest reason why I didn't go towards the S23\/24 is the size. If I wanted the \"top\" phone in that model, the Ultra's have the pen and it's essentially a Samsung tab phone from years ago. I feel like 8 Pro is a decent size  \n5. The screen size is pretty good, I can watch videos on it comfortably  \n6. The fact that it is made by Google means no Bixby, which is (like point 2) awesome because even back in Samsung, I used Google assistant anyway  \n7. With an exception to point 2, I like how customizable it is, like I said, I don't do a lot of things on my phone so I am easy to please in this regard\n\n&#x200B;\n\nCons: Unfortunately, this outweighs the Pro's for me  \n1. Randomly, incoming phone calls get dropped before it even reaches me, I wear the watch most of the time so I should at least know if someone calls me, but even then I only get notified after I missed the call (no ring whatsoever). I've checked my DnD which is never on, and it also happens to incoming calls from my saved contact list and other unknown numbers both from my region and outside. Checked with support and my provider and both basically pointed fingers at each other, only way to truly test this is to daily drive my old phone for a while. I haven't but I've never experienced this at all in my old phones from the same provider on the same account  \n2. Dark mode on the Google search widget randomly gets disabled. I have dark mode always on, but sometimes when I search something on the widget, when it loads, it's on light mode. And the only way to revert this is to go on the settings and disable dark mode and re-enable it. Interestingly, this issue started to happen recently, so I'm guessing from an OS upgrade  \n3. Again with the Google search widget, randomly, whenever I search something, after pressing enter it says no network connection, but after I click \"Try again\" it works. Happens both on Wi-Fi and cell data. I have a different browser that also have a widget, I want to try it but Google as a search engine is still a beast, so I'm debating whether I should do it or not  \n4. Randomly, the weather widget just stops working. It's still there, but no weather info, can't refresh it either  \n5. Another random issue, there's times when I hit the home button (from somewhere, doesn't matter if it is a browser, social media app, YouTube or whatever), the keyboard pops up. But I have nothing to type on because it's the homepage, not sure why the software brings it up randomly  \n6. This is a small issue for me, I hate Google Photos, and the Google Gallery app is not as good as Samsung's gallery app imo. There are features on Samsung that I love, for example, if I edit a photo on Samsung, it asks if I want to save a copy or save to overwrite the original, but with Pixel, it just saves copy. I do quick and simple edits for work so it's annoying that I need to delete the original because I never need it, though I understand it's by design since it's a good idea to have the original, but at least give the option  \n7. Another small issue, the vibrate isn't strong enough. There are times when I need the phone to be near-silent but still know when I have notifications (hence vibrate) but even if it's in my back pocket, sometimes I still miss it. This is now a small issue for me because I usually wear the watch, so at least my wrist would feel something when I get notifications  \n8. Sometimes, the phone freezes for several moments. I have to click the lock button, or spam the home button and it miraculously works after  \n9. Just recently (probably caused by another update), when I am connected to my earbuds (not Google) or car through Android Auto, the phone randomly \"goes on call\" but there's no call window on the phone or the car screen. I know I am on call because the earbud goes on hear-through even though it is set on ANC which typically happens when I am on call. Also, the car dashboard says \"In a call\" when I am (even though the Android Auto screen doesn't)  \n10. Initial setup with Android Auto when I first got the phone was a NIGHTMARE. I remember my old Samsung and it was literally plug and play then configure afterwards. But for this, I had to do some wonky workaround I found online to get it to work\nEdit: 11. Sometimes, my home Wi-Fi doesn't automatically connect, it's not a broadcasted SSID so I have to manually add it. There was a time when I had to tinker with the settings to get it to work.. Something I never had to do with my old phone\n\nTL;DR: Hardware wise, the feel of the phone is good, camera is exceptional for my use and it's not \"struggling\" for me. But SOOOO MANY bugs on the software that doesn't get fixed right away or just haven't been fixed.\n\nI would love to get another Pixel because Samsung is more expensive and the Ultra is too large for my taste (top of the line have better freebies :D) but if by the time I switch phone I'm still having these issues, I'll definitely go back to Samsung","16":"Praise for Pixel Buds-A+I don't know if this is cool or not here, but I just had a great experience with my earbuds and wanted to praise Google a little bit.\n\nTwo days ago I finished a run, and afterwards put my pixel buds-a (which I use on runs) on a table. They were sweaty and salty. \n\nMy dog loves salty foods. She ate them. At first I thought I was going crazy because I couldn't find them, and then I saw her cough one up. I got it but not the other one. \n\nI was a bit concerned about the lithium battery inside of her, but my dog is a gulper, not a chewer: the first bud came out intact and pristine, so I had a hope the other bud was not chewed up as well.\n\nThe next day, I found the second bud in her poop. Completely intact, looked like new, except poopy. I cleaned up both buds with rubbing alcohol, replaced the little rubber nubs, charged them up, and just now tried them out. \n\nReader, they sound as good as new. Google build the cheap version of their buds well enough to withstand the insides of a dog. Nice work y'all. ","17":"Pixel Buds Pro 2 keeps activating while in case+The first gen would also do this, but not nearly as much. It also was an easy fix, I simply pushed down a bit on the earbuds for it to recognize they're in the case. But this doesn't always work on these buds. Even removing them and putting them back in doesn't work 100% of the time. I bought directly from Google. Should I tell them to have them fixed?","18":"Any expected new Pixel Tablet coming?+Is there an upcoming Tablet from Google?\n\nI wanna buy a Smartphone, Tablet and Earbuds from the same company.\n\nSamsung has great stuff but I'm more into Google Pixel recently.\n\n","19":"After december update I cant turn on LDAC on my Huawei freebuds pro 3 earbuds..+Thanks google for messed up bt Ldac codec... On my pixel 7 and my wifes 6a . ","20":"Future Pixel Products?+Hey Pixel Community,\n\njust wanted to know from you guys and girls, what do you think could come to the Pixel Ecosystem?\n\nHope we can have a good Discussion what Google maybe develop in the future.\n\n1. If i remember correctly 2 years ago everyone thought we get the Pixel Dot or G-Spot (Airtag alternativ). But still no sign if we get this or not. Moto Tag is now here but still not as good as Airtags and Samsung Smarttags are only good with Samsung phones. so what do you think.\n\n2. After the Pixel buds pro 2 were a really good upgrade over older Pixel Buds do you guys think Google will release more Music \/ Audio products? maybe something like Airpods 4 (Earbuds without eartips but with ANC). Also an Option would be something like the Nothing Ear Open or Shokz Open fit \/Air, Open Ear buds Design or even with Eartips like from 1more S50. If we get the Pixel Buds pro 3 in 2-3 years i myself hope they add changeable Wingtips like the Soundcore Liberty 3 pro had.\n\n3. Just an addition to Audio Products. What do you think about Over ear headphones or bluetooth speakers (also for outdoor usage like JBL does).\n\n4. How will Chromebooks develop in the future. Will they be more like Laptops or more like Tablets? Will Chrome OS Stay and will become better or will it integrate Android more and more and maybe Chrome OS will become Android OS or something comepletly new?\n\n5. Will we get a new generation of the Pixel Tablet. Really would like to see Pixel Tablet Gen 2 with a better and cheaper Docking Station and maybe 2 Versions of the Tablet. An 8\" and an 11\" Version. I really would like to have a new tablet at home (small 8\").\n\n6. New Nest Products? New Nest Hub Gen 3. Or will Nest fusion with the Pixel Tablet?\n\n7. Pixel Glasses even if i think its not really much that needed.\n\n8. What do you all think Google could develop in the future. Let me know here.\n\nGreetings\n\n\n\n","21":"Farewell to Pixel after a decade! I am done with unstable unreliable software.+I am moving away from Google and transition to Apple, despite the substantial cost involved in switching ecosystems and given I have been a Android\/Pixel user for the last 10+ years. \n\nI have been a committed Pixel user since its inception, experimenting with every app, accessory, watch, phone, etc. I also used Google Fi for five years.\n\nHowever, a recent incident has prompted me to reconsider my loyalty. The ongoing issue of network connectivity has been a source of frustration, and last week, a new problem arose: suddenly, my META apps (WhatsApp, Instagram, Facebook) could no longer access the phone's microphone. While in-app video recording has always been subpar compared to the phone's native camera, this specific issue was unprecedented. All the permissions are checked, no hardware issue and camera app records fine.\n\nAfter consulting various blogs and users facing similar difficulties, I contacted Google. Despite following all the suggested troubleshooting steps, including a factory reset after backing up my data, I encountered a significant setback. I forgot that my WhatsApp backup was encrypted. Consequently, after the reset, I was unable to restore my backup. After several unsuccessful attempts, WhatsApp automatically deleted all backups, causing me to lose precious memories, including voice clips from my late grandfather. And the issue continues. When I contacted Google about it I was recommended to take the phone to a private service center and they couldn't do anything.\n\nWhile I do not blame Google for WhatsApp’s automatic deletion of backups or my own oversight, I am exhausted by the instability of pixel softwares, which can render a device virtually inoperable or constantly dependent on updates. It slows down so fast as well.\n\nI expected basic functionality from a smartphone, but recent models, especially since the Pixel 3xl, have been disappointing. The Pixel 6 was notably problematic and I had one replaced under the warranty and it seems this trend persists with newer models.\n\nTherefore, I am bidding farewell to the Pixel 7, Pixel Watch, and earbuds. After more than a decade, I am returning to Apple.\n\nTo everyone else, please ensure your data and backups are secure. Despite my best efforts, the loss of a single WhatsApp backup erased many irreplaceable memories I dearly wish I could revisit.\n\nAnd to Google, I can't comprehend how unreliable your softwares and hardwares are for a company of your size. I would have been the last person to jump off the boat and even if I have done it that means so many more has already left you."}}