{"sentiment":{"0":"Negative","1":"Negative","2":"Negative","3":"Negative","4":"Negative","5":"Negative","6":"Negative","7":"Negative","8":"Negative","9":"Negative","10":"Negative","11":"Negative","12":"Negative","13":"Negative","14":"Negative","15":"Negative"},"user_review":{"0":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","1":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","2":"Just switched from an iPhone to the Pixel 9 Pro XL+After years of being deep in the Apple ecosystem I made the switch to a Pixel. It was a little easier once my MacBook usage fell off after college and I started using my Apple Watch as a Fitbit basically. ","3":"Pixel 6 to Pixel 8 or 9? How's the fingerprint sensor+I have the Pixel 6 for years now. I use it as my secondary phone.  Here is the thing. I stopped trying to unlock it with my fingerprint, because it's extremely annoying. So i just input my pin number each time. I got used to this method, since it's my secondary phone, I don't have to unlock it a lot of times, maybe 5-6 times a day to check for my job related emails. Here is my question. Since I still would like to have a fingerprint sensor to unlock, did they fix the fingerprint sensor in the Pixel 8 or the 9? I am hearing conflicting opinions so if it's still an issue, I will be looking for another brand as my next upgrade. ","4":"Google Pixel 9 Pro XL and Notifications+Hi everyone,I just got my 9 Pro XL last week.  Still sort of setting it up, it's a work phone for me.Question. Is anyone having issue receiving push notifications for any of their apps, 2fa etc?  Literally none of mine are working.  I have uninstalled reinstalled, deprovisioned and reprovisioned all of my accounts but they are not working.Its been a few years now since I have been away from Android.  Not sure what to make of this.Any advice?Thanks!","5":"Pixel Pricing is Going Crazy! +So we are now seeing $150 CAD price increase in Regular Pixel Variant every year. $799 - Pixel 7$949 - Pixel 8$1099 - Pixel 9 The pricing has gone really crazy, I don't want to spend $1099 + tax for a Non-Pro version and that too for a 128GB version. Hell nah!And Why on the hell they released Pixel 9 Pro XL 😑 ","6":"Pixel 9 Pro Fold - Reboots but not reboots?+Hello,After my phone discharged last night I'm having some weird issues today. My phone will do like a \"fake\" reboot. It disconnects from everything, my samrt watch tells me the phone disconnect for about a second, it becomes unresponsives, and then wakes up and says \"Pin required are device restart\" &nbsp;The problem is, it doesn't restart. The screen flashes to pitch black for less than a second, and then lock screen appears. In the Settings > About Phone uptime is currently 14 minutes, but it happened less than 3 minutes ago and has happened at least 8 times since I woke up 2 hours ago. &nbsp;I've tried \"real\" poweroff and reboots several times.Anyone else had anything similar?&nbsp;**UPDATE:**&nbsp;Didn't see this reply until now when I went back to update the post. &nbsp;For anyone here in the future: I returned my fold and went back to my Pixel 8 Pro - Which I then dropped a week ago and ended up with a Pixel 9 Pro XL.&nbsp;When I copied data and apps from the Pixel 8 to the 9, I got the exact same issue. I ended up factory resetting and simply installed all my apps manually. I took 4 hours, but no problems after that. Must be some app that transfered between phones that ended up crashing\/bricking the system.","7":"Just switched from an iPhone to the Pixel 9 Pro XL+After years of being deep in the Apple ecosystem I made the switch to a Pixel. It was a little easier once my MacBook usage fell off after college and I started using my Apple Watch as a Fitbit basically. ","8":"Just moved from the iPhone 15 pro to pixel 8 pro and I hate the black bar at the bottom. How is no one talking about this? +https:\/\/ibb.co\/GWqgRVGI am an avid firefox user and browse a lot on the phone. This black bar is so ugly. It's even on chrome. So much of screen real estate is wasted because of this","9":"Buyer Beware: The Official Google Phone Cases will not protect your Pixel 9 Pro XL+My phone fell out of my pocket hit the pavement on the corner and cracked the phone case, the screen protector and the screen in the corner. $40 down the drain. ","10":"Ordered a Pixel 9 Pro from the Google Store, and they sent me an EMPTY box. After days of back-and-forth with support, Google finally agreed to send a replacement—and guess what? ANOTHER EMPTY BOX!+After this second empty box (RMA29015280), they closed my case, citing their \"policies,\" and refused to replace it again, even though the tracking clearly shows the package was tampered with and the phone was stolen in transit. No one at Google is even looking at the tracking or bothering to reach out to UPS. (**Damage Reported**, Merchandise is missing. UPS will notify the sender with additional details.)Never buying from the Google Store again. (I’ve now filed a chargeback with my bank)","11":"Need help!! Damaged phone!!Does Google Pixel 8 support video out (via USB-C\/HDMI)? I need this to get my pictures\/data out+Hi, I need some help! My phone screen is damaged, and the bottom half doesn't work anymore. Backup stopped a few months ago (due to me procrastinating cleaning up my google cloud). I'm trying to pull off some pictures from my vacation with my family from my pixel 8. I'm seeing conflicting reports on Reddit about whether video out via USB-C\/HDMI hub works for the pixel 8 and was hoping someone knows\/can test it out.","12":"Pixel 9 series price increase would've been better received if they had bumped up the base storage to 256 GB+A lot of people seem unhappy about the price increases of the Pixel 9 phones, and rightfully so. The spec upgrades from the 8 series are few, and this is the second consecutive year of a price increase, coming off the tail of the Pixel 8. Not to mention the fact that having 128 GB of storage in a 2024 flagship phone is somewhat contentious, since most Androids in this price class have 256 GB as the minimum.","13":"Would you rather have pixel 10 pro XL, s25U or one plus 13 for the next 3 years. 2025 flagship choices+Out of the 3 I'd probably go for pixel 10 pro XL due to the software and design\/ user friendly interface of the phone because I dont game on my phone How about you?","14":"The Pixel Launcher is starting to roll out a new \"search engine\" settings page+This page lets you change the search provider used for the search bar on the home screen.One user tells me they received a notification from the Search Engine Selector app to choose their search engine. After changing the search provider, the search bar's icon is updated to reflect the user's choice of provider. The user can go to the Pixel Launcher's settings then tap \"home screen search settings\" and finally \"search engine\" to change the search provider afterwards.This is starting to roll out to users in Europe and comes as the DMA recently went into effect. Google announced last week that users in the EEA will see \"additional choice screens\" including one for selecting a default search engine when setting up a new Android device.Here are some screenshots: [1](https:\/\/pbs.twimg.com\/media\/GIvIx-GWIAA10v3?format=jpg&name=large) [2](https:\/\/pbs.twimg.com\/media\/GIvIzCvWkAAEM47?format=jpg&name=large) [3](https:\/\/pbs.twimg.com\/media\/GIvI0cuWEAAunRb?format=jpg&name=large) [4](https:\/\/pbs.twimg.com\/media\/GIvI2m4X0AAVsrl?format=jpg&name=large)","15":"Finally got a Desktop Mode working!!+Thanks to the new version of scrcpy and Android 15! Can now have Phone Screen Off and Tablet Mode enabled!      Steps:  Download version 3.x from here: [https:\/\/github.com\/Genymobile\/scrcpy](https:\/\/github.com\/Genymobile\/scrcpy)    Turn on Developer Settings  Turn on USB Debugging  Enable Force activiteis to be resizable (Lets you drag the corner of apps to change size)  Enable Freeform windows (Lets you move the apps around the screen)  Enable Freeform Windows on Secondary Display  Enable non-resizable in Multi-Window (I'm using a secondary display from my Pixel 8 - though some might want to mirror.)    Reboot.    Plug phone in to PC - Accept the USB Debug AUTH prompt. (You can of course do this with wireless ADB as well though expect lag).  Open up a command prompt where you extracted SCRCPY too and run this command.      scrcpy --new-display=2560x1200\/120    Change resolution to what you like. The \/120 is the DPI. Use a low DPI for Tablet mode.    This will then create a secondary display from your phone (you can still use your phone as well!) or you can just leave the phone screen off!    I have been waiting for this day for years! Only thing missing is a taskbar though other phones may work there is no nice taskbar on my Pixel 8 Pro.    You can also play around with codecs and framerate if you like with parameters like    \\--video-codec=h265  \\--max-fps=60  \\--video-codec=av1    Hope this helps some people!"}}