{"sentiment":{"0":"Positive","1":"Positive","2":"Positive","3":"Positive","4":"Positive","5":"Positive","6":"Positive","7":"Positive","8":"Positive","9":"Positive","10":"Positive","11":"Positive","12":"Positive","13":"Positive","14":"Positive","15":"Positive","16":"Positive","17":"Positive","18":"Positive","19":"Positive","20":"Positive","21":"Positive","22":"Positive","23":"Positive","24":"Positive","25":"Positive"},"user_review":{"0":"What 3 to 4 features do you think Google must focus on Android 16?+Fellows, I have been enjoying my Pixel 8a for around a month, but I still think there are a couple of features that Google should improve. In my case, if I were the Product Owner, I'd like to try to focus on three topics:1. **Complete the freefloating form feature.** I have tested it, and for me, it was something I actually missed from my old Oppo A91. It seems almost ready, but I cannot overlap apps in my phone. Maybe it's a bug, but I would rather this than the Bubbles for all.2. **Improve the video camera.** I went to Sweden to see the Northern Lights and the [results](https:\/\/www.instagram.com\/p\/DD6kIEPtQEj\/?img_index=1) were better than I expected. However, the videos were terrible. I could barely see anything.3. **Allow double-tap to lock.** Several phones have it including my old Huawei.I have also some nice to have:* Bring back the tiles for Data and WiFi or at least, give us the developers the right to the dirty job. I know it's controversial, but I'd like to have them.* Allow the phone to be scheduled when to turn it on or off. My old Oppo has it.* Allow the Alarm to turn on the phone if it's off. My old Oppo has it.* Allow swiping actions like the three fingers for taking screenshots. My old Oppo has it.Maybe you have other ideas or agree with mine. I prefer to focus on specific features that, if we're lucky, the Android\/Pixel product owner might hear us out about before they dive deeper into development of things that we might not like or agree with their \"research\". Plus, if we just rely on sending feedback through the app, I find it often ends up on deaf ears.Have amazing holidays.","1":"All Pixel 9 Pro upgrades over Pixel 9+Below is the list of all the upgrades you get in the pro phone -1. 1mm extra screen size (insignificant)2. Slightly thinner bezels (insignificant)3. LTPO display (1Hz minimum) (better standby battery life, especially with AOD)4. Slightly Higher Display Resolution5. Higher HDR and peak brightness levels (better outside visibility)6. Vapour Chamber (better thermals and lesser throttling)7. ~~4GB~~ 1.4 GB extra RAM (better multitasking) (2.6GB RAM is reserved for AI tasks, regardless if you use it or not) [*moreinfo*](https:\/\/www.androidauthority.com\/tested-pixel-9-pro-ai-ram-3472624\/)8. Telephoto Camera (48MP) (5x zoom)   1. 8K 30FPS video (artificially upscaled to 8K)   2. Super Res Zoom Video9. 42MP selfie camera (wider)10. Pro controls in Google Camera (software locked by Google)11. Matte back glass + Polished rails12. 1 Year Free Google One subscription (with 2TB storage + Gemini Advanced) (only for purchases before 31st Oct 2024)13. Ultrawideband Support14. ThermometerAll the differences are lised in a single place to help make a more informed purchase decision(do list any differences that I might've missed and I'll add it in the list)","2":"Google has acknowledged the Pixel 6, 6 Pro, 6a factory reset bug that results in a brick+# Update 7\/19\/24Google's team has identified a solution for people experiencing issues after factory resetting your Pixel 6, 6 Pro, or 6a. They are urging affected users to contact [support](https:\/\/support.google.com\/pixelphone\/gethelp) for additional support. Check the [offical thread](https:\/\/support.google.com\/pixelphone\/thread\/283220215) for more details.Edit: I have launched a [survey](https:\/\/www.reddit.com\/r\/GooglePixel\/comments\/1e9jxeg\/survey_pixel_6_series_bricked_after_factory_reset\/) here on reddit about your service centre experience. Please give it a visit and share your experience.# OriginalThe Google Pixel Support Team has identified the root cause of the issue and is working on developing the best possible solution. Check out this thread..[Issues after Factory Resetting Pixel 6 Devices](https:\/\/support.google.com\/pixelphone\/thread\/283220215)# If you have a working phone* Leave your device powered on and idle for **15 minutes** after it has rebooted following a system update. Factory reset **only after that.*** Or Factory reset **before** taking the latest system update.# If you have a bricked phone* Follow the above mentioned thread for more updates from the Google Pixel Support Team* Click on 'I have the same quesion' button to indicate you are facing the same issue# If you are on Android 15 beta* Please \"star\" and \"+1\" these issues on Android Beta Issue Tracker* [Pixel 6 cannot turn on after factory reset](https:\/\/issuetracker.google.com\/issues\/344963939)* [pixel 6 bricked](https:\/\/issuetracker.google.com\/issues\/349860641)Lastly, I'd like to thank you all very much for the overwhelmingly positive response on my [compilation thread](https:\/\/www.reddit.com\/r\/GooglePixel\/comments\/1drgmvx\/another_pixel_6a_mine_bootloopbricked_from\/). Many thanks to [The Verge](https:\/\/www.theverge.com\/2024\/7\/1\/24190024\/google-pixel-6-factory-reset-bricking-phones), [9to5Google](https:\/\/9to5google.com\/2024\/07\/01\/pixel-6-reset-bricking-reports\/), [Android Authority](https:\/\/www.androidauthority.com\/pixel-6-series-factory-reset-brick-3456346\/), [Android Central](https:\/\/www.androidcentral.com\/phones\/google-pixel-6-factory-reset-might-zap-your-phone), [Android Police](https:\/\/www.androidpolice.com\/pixel-6-factory-reset-brick\/), [droidlife](https:\/\/www.droid-life.com\/2024\/07\/01\/dont-factory-reset-your-pixel-6-it-may-brick\/) and many other tech news outlets for covering the issue.This is what a healthy, positive community looks like!Edit: [I fixed my factory reset bricked 6a](https:\/\/www.reddit.com\/r\/GooglePixel\/comments\/1dvjkey\/service_centre_tried_to_trick_me_into_paying_for\/) (OEM unlocking off and bootloader locked). It was at the service centre. They wanted me to pay for a motherboard replacement. I rejected and Google sent it back to me un-repaied. It wasn't booting, but the **bootloader was** **unlocked.** I used the Android Flash Tool to flash Android 14 and it booted. They can unlock the bootloader and unbrick your phone. They just don't want to do it.Edit 2: A lot of people are wondering whether it's safe to update to the latest patch. I do not know about updating, but as stated above I directly flashed the July patch and my 6a is working fantastic. You should be fine as long as you follow the instructions.","3":"After 6 years of Pixel, ready to quit+I've been using Pixel phones for 6 years now and the experience has been great, but lately I've had so many problems I've ready to make the jump to Apple because Google can't stop breaking things.  Currently have a Pixel 6a and recently experienced the following problems:* Wifi continuously disconnects on my home network (two Google Wifi pucks).  This just started in February after a phone update, nothing else changed.  Same internet, same wifi.  So Google broke this obviously and it's impossible to get help.  My family owns iPhones, and two Pixel users (Pixel 7) who aren't experiencing this.  My wifi works great on every wifi network but my home network.* When I make a phone call and need to hit \"1\" for a menu option, it doesn't work.  Call on my wife's iPhone, works fine.  Give me a break...* The Youtube app starts flaking after some amount of time, no pause button and the video is dark.  I have to kill the app to fix it, and then a while later it starts flaking again.With today's tech it seems everything that is working perfectly well is at risk of breaking with the next update.  If Apple gets it right and their product just works when I need it to work, then I'll make the switch.  I've been very happy up until now with Pixel phones, but there's no excuse to continually break simple stuff with each update, they can do better than that.","4":"Husband just got a strange ‘spoken’ message on his Google Pixel 6?!?+UPDATE: I’m overwhelmed by so many great responses\/empathetic stories - thank you all so much ❣️ Please read my ETA’s for answers to questions several have asked…=========================So, a few minutes ago (~10:30pm Central time), my husband was asleep - and his phone, as usual, was in Sleep mode with Do Not Disturb automatically turned on - when he was woken from a sound sleep with his phone speaking some kind of message about Trump (he wasn’t sure - he was just asleep! - if it was a pro or anti-Trump message).  He then checked his phone and there was NO open app or recent notification.Before anyone asks if “he was dreaming”, he walked out to the living room to tell me about it and I could hear his phone from the bedroom speaking some OTHER message (we couldn’t hear it from there exactly what the message said).Not sure if it’s connected, but his phone recently updated to Android 15.  So, WTF is this !!??!ETA: also, several people has asked, and, no, he doesn’t use Google Assistant…Please see my last ETA about the Assistant history…ETA:  the big puzzle is what could break through DND?  A quick Google shows no apparent log (that I could find) that the DND keeps if it’s interrupted?ETA:  We also have an Echo Spot in the bedroom, but Activity History on the device doesn’t show any activity at the time this happened…?ETA: I’m adding this part to answer several similar questions….I’ve said in several replies (and I’m truly sorry that I haven’t more promptly replied to all the 160+ comments which my question prompted, and I thank all of you for each one!) that we both do not Intentionally use Google Assistant.    Since we don’t intentionally use it, I wouldn’t have known until someone suggested to look at Google Assistant history.  So, after researching how to do that, I just now searched his Google Assistant history —- and it does not show ANY activity at all last night - Oct 28 - at around 10:30 pm.   There is an entry that only said “Used Assistant” on Oct 27 at 6:10pm.  There is also an entry for today - Oct 29 -  saying the same “Used Assistant” at 12:14pm.  No other details other than that.  However, there is no entry for Oct 28 at all, let alone for 10:30 pm.  Since we don’t intentionally use Google Assistant (by intentional, I mean by saying Hey Google), I was surprised to see ANYthing in the history.  But those are the entries I found, and (even though I don’t know what triggered those entries) I have no idea what “Used Assistant” without any further details even means, but I don’t believe it indicates that Google Assistant was the culprit.Hopefully this might encourage people to stop downvoting me?  Because I really don’t understand why the downvotes.  But, this is Reddit, so I accept that happens.  ","5":"Any Pixel 7 owners heading into 2025 with their phone?+How do you find it? Are you still enjoying it? Any plans to upgrade? Thanks!","6":"Google's 7-Year Update Promise, what do you really think?+Google's commitment to **7 years of updates** is a big deal, but I wonder if it’s sustainable. Will we actually be getting meaningful updates for that long, or just security patches after year 4?Apple has done **5+ years** consistently, but Android brands haven’t had the best track record. Will the device even stay smooth for that long, or will it be another case of \"updates slowing down older devices\"?","7":"My experience with Pixel 9 Pro XL as daily driver for 10 days and why I'm returning it.+Hey everyone, I know you're not big fans of negative opinions, but I wanted to share my experience with the Pixel 9 Pro XL after using it for almost 10 days. At first, I was super excited like everyone else. When I got the phone, my initial thought was that it looked amazing. I quickly set it up and was really impressed with the new fingerprint sensor. The phone did get pretty hot during setup, but that's probably normal.I transferred my eSIM from my S24 Ultra and started using the Pixel as my daily driver. Unfortunately, the very next day, I was in for a shock when I went to my local grocery store. I realized the connectivity wasn't much better than my old Pixel 8 Pro. The phone switched to 3G, and the data speed dropped dramatically, making it almost unusable. I quickly checked my wife's iPhone 15 Pro Max, and it still had a perfect connection with great data transfer. Even phone calls were choppy.The next day, I went back to the same shop with my S24 Ultra, and there wasn't any issue. Fast forward a couple of days, and we went on a trip with our kids. My wife and I took lots of pictures - me with the Pixel and her with the iPhone. On the small screens, everything looked fine, but when we reviewed the photos on a computer, oh man, the Pixel's portrait shots were way worse. The edge detection was awful, and the kids' skin looked weirdly smoothed out, like they had makeup on to hide imperfections. The other pictures were okay, maybe comparable to the iPhone's.The final straw that made me decide to return the Pixel was the animation stuttering, especially noticeable during transitions and scrolling. Twitter also acted up, often failing to load pictures and videos. I had to force-close and restart it multiple times a day to get it working properly.Sorry, but it just doesn't feel like a premium phone. Google should either offer a better price or better specs. In my opinion, this phone is worth no more than 600 euros, not 1200. I know I'll probably get a lot of downvotes for this post, but this is my experience and personal view. I really wanted to like the phone and keep it as my daily driver, but it's just not comparable to real flagships at all.","8":"Do you think Google will go big with Pixel 10?+Do you think since it will be their 10th iteration of a phone, that they will \"go big\"? Define that as you will. But mostly go over the top with new stuff, or just the normal-ish upgrades? I think it would be cool to see them pull out a lot of big stops for it honestly. * Ultra bright display* Anti reflection * Camera system upgrades as best as possible* UFS 4+* Large battery* New software features (I like that create a gif feature on new samsungs!) * I wish they had Proper Face ID (even tho the rumor is Pixel 11) * Video Boost on device?","9":"Are y'all jumping for the incremental changes or waiting for the pixel 10?+With the 9 on the horizon, who's gonna get one and who's going to wait for the 10? With talk about the new chip manufacturer I'm going to wait. I bought a pixel 7 as my first Google phone right before the 8 came out. As a long time Galaxy user, I loved the simplicity. I almost never get new phones every year since they're usually incremental improvements at best and blatant money grabs at worst.What do y'all think?","10":"All Pixel 9 Pro upgrades over Pixel 9+Below is the list of all the upgrades you get in the pro phone -1. 1mm extra screen size (insignificant)2. Slightly thinner bezels (insignificant)3. LTPO display (1Hz minimum) (better standby battery life, especially with AOD)4. Slightly Higher Display Resolution5. Higher HDR and peak brightness levels (better outside visibility)6. Vapour Chamber (better thermals and lesser throttling)7. ~~4GB~~ 1.4 GB extra RAM (better multitasking) (2.6GB RAM is reserved for AI tasks, regardless if you use it or not) [*moreinfo*](https:\/\/www.androidauthority.com\/tested-pixel-9-pro-ai-ram-3472624\/)8. Telephoto Camera (48MP) (5x zoom)   1. 8K 30FPS video (artificially upscaled to 8K)   2. Super Res Zoom Video9. 42MP selfie camera (wider)10. Pro controls in Google Camera (software locked by Google)11. Matte back glass + Polished rails12. 1 Year Free Google One subscription (with 2TB storage + Gemini Advanced) (only for purchases before 31st Oct 2024)13. Ultrawideband Support14. ThermometerAll the differences are lised in a single place to help make a more informed purchase decision(do list any differences that I might've missed and I'll add it in the list)","11":"Pixel 9 for $299 at Mint with 12 month plan +Sharing for anyone else that may be interested because I just bought this myself. It’s the 128 gb version and it says you have to bring your number to Mint. ","12":"Emergency SOS...the new way to send nudes to friends+My day started off quite interestingly...have to share this one 😅I went to bed a little late last night, but had to be up at 8am for some stuff. Set an alarm, no big deal.8am rolls around, and I wake up to the familiar ringing sound. Half asleep, I start swatting at my phone, trying to press buttons to shut it up. In the process, I somehow hit the power button 5x and set off Emergency SOS.The gentle ringing alarm turns into that blaring siren sound, jolting me about 5ft in the air, scrambling to stop it. I grab my phone and look at the screen (still half asleep). I see the notifications for \"calling 911\" and stuff about sending location and whatever else to emergency contacts. I'm thinking \"SHIT emergency services are going to come, my friends will get scared, and I'm just laying here naked in bed!!\"I cancel everything, and scramble to type in \"phone glitched\" for the reason I'm canceling the SOS, before I scare some 12 emergency contacts.The phone starts ringing and texts start coming in. Friends are concerned...but not so much about my safety but rather that **MY PIXEL SENT EVERYBODY PHOTO\/VIDEO OF ME NAKED** 😅😅**So yes, Pixel's SOS features are a great way to send dick pics to people, folks.**Hope this gave everyone a good laugh. Before anyone gets all serious, yes I know I can change SOS to require I hold the circle on the screen for 3 seconds, and nobody was upset or offended. My embarrassment gave everyone a jolly start to their day or a fun 1am booty call, depending on time zone.**CENSORED \\*\\*but still NSFW\\*\\* PICS YOU'VE ALL BEEN BEGGING ME FOR:** [**https:\/\/imgur.com\/a\/ort8yxD**](https:\/\/imgur.com\/a\/ort8yxD)*\\*Mods, if this isn't okay, please just remove the link or DM me and I will. It is censored, and so many people keep asking...given it's making everyone laugh, I hope you don't remove my whole post❤️\"**\\*\\*No, I will not provide uncensored pics, here or via DM. Sorry!*","13":"All Pixel 9 Pro upgrades over Pixel 9+Below is the list of all the upgrades you get in the pro phone -1. 1mm extra screen size (insignificant)2. Slightly thinner bezels (insignificant)3. LTPO display (1Hz minimum) (better standby battery life, especially with AOD)4. Slightly Higher Display Resolution5. Higher HDR and peak brightness levels (better outside visibility)6. Vapour Chamber (better thermals and lesser throttling)7. ~~4GB~~ 1.4 GB extra RAM (better multitasking) (2.6GB RAM is reserved for AI tasks, regardless if you use it or not) [*moreinfo*](https:\/\/www.androidauthority.com\/tested-pixel-9-pro-ai-ram-3472624\/)8. Telephoto Camera (48MP) (5x zoom)   1. 8K 30FPS video (artificially upscaled to 8K)   2. Super Res Zoom Video9. 42MP selfie camera (wider)10. Pro controls in Google Camera (software locked by Google)11. Matte back glass + Polished rails12. 1 Year Free Google One subscription (with 2TB storage + Gemini Advanced) (only for purchases before 31st Oct 2024)13. Ultrawideband Support14. ThermometerAll the differences are lised in a single place to help make a more informed purchase decision(do list any differences that I might've missed and I'll add it in the list)","14":"Interested in OnePlus 13 but fear I'll miss out on Pixel exclusives+Currently, I'm a current Pixel 7, on Google Fi and a Google 1 subscriber. I'm interested in the OnePlus 13 but I'm wondering what I'll miss about Pixel ownership. I know the OnePlus should do all the Google Assistant and Gemini things. I think I'll lose some spam blocking on phone calls. I also think I'll lose Google Photos AI photo tools, but maybe that comes with any phone with Google Photos and Google 1?What features am I not considering?","15":"Pixel 9 Pro XL charging surprise hints at a big change in how Google is approaching charging.+Playing around with the various Anker chargers I had on hand and a USB-C power meter, I noticed something a bit shocking about the charging of the Pixel 9 Pro XL.When I looked at the charge specs of the 45 watt official charger, I saw that the PPS spec was defined as such.\"PPS: up to 11V\/3A, 16V\/3A, 21V\/2.25A max 45W\"Immediately I noticed that amperage maxed out at 3amps for the various ranges (with less for the 21v).  This was a departure on how Samsung gets 45w output where they keep it at around 11v and up the amperage to 4amps.  This has a side effect of requiring a 5A (emarked) cable for max charge rates. So, I looked at that and thought that Google must be using some voltage higher than 11v to get that 37w.  So, I was assuming they were doing something like 12.3v@3A or maybe possibly 16v@2.3A.  I doubted the later though since that was a pretty high voltage transformation to do in a phone.Well, I tried one of my Anker chargers that did 3.3v-16v@3A and discovered that it topped out at 27w even at a lower battery state.  I tried another and noticed the same.Then I tried my Anker Prime 2700 battery bank which goes up to 21v with PPS and it immediately jumped up to 32w (the battery wasn't fully drained).  What surprised me is that it was 17.9v@1.78a.  Actually, surprised doesn't even cover it, I was gobsmacked.This is pretty unheard of in the mobile world.  Voltage transformation typically generates a lot of heat so the popular approach is to increase amps.  You see it with the Samsung Super Fast Charging 2.0 with the 11v@4A output.  You even see it with something like SuperVOOC with OnePlus (80w is 11v@7.3A).This is why I've always felt that manufacturers that wanted to stick to the PD spec were going to run up against a hard ceiling around 55w or so for fast charging these phones since you wouldn't really want to stray beyond 11v.  However, here comes google charging at nearly double the voltage and I'm kinda stunned that no one is talking about it.There's a few significant things about this.  First, there's going to be lower compatibility across existing PPS chargers out there.  Some do go up to 21v, but most of the Anker stuff that's out there tops out at 16v and sometimes 11v.  It seems that if you can't do \\~18v PPS, the P9PXL will top out at 27w essentially doing 9v@3a.  So, that's something to be aware of if you stray from Google's official charger.  It looks like a few of the Ugreen ones go up to 21v so they may work properly.  Companies are really shoddy (Anker, I'm looking at you) about giving all their charging specs so it's likely going to be a bit rough finding 3rd party chargers that go at max rate.Second, I can't think of any reason why Google would be doing this unless they had plans to go BIG with charging down the line and this is the first step.  Unless I'm grossly mistaken, this requires specifically chosen and not so common hardware in the charging circuit design to have a charge pump that does this extreme of a transformation.  There's no real reason to go this route instead of upping the amperage unless you wanted to go beyond the 50w mark in the future as far as I know.  This also highlights Google's heat mitigation for this year's models since the reason why this much voltage transformation is traditionally not done is because it generates heat.I want to point out again that I don't understand why some more technical minded publication hasn't run with this yet.  I'm far from an expert in things like charging, I just know enough to spot something that's an outlier and recognize the general constraints of smaller mobile devices.  I would love for someone who really understands PD design and charging circuits to really dig into this and all the implications.  This was a deliberate choice by Google and it is a very unusual one (and frankly bold for a company that usually plays it safe.)","16":"I'm 18 but still have parental controls+It's not the whole phone only the play store and I've asked my parents to check it and they said it's not an issue on their end and that they have no input on it. I've put the correct pin in when asked to turn it off but everytime I try to do so it says it can't save it and doesn't work.Is this a known issue or is my playstore just acting up?","17":"'device too warm, exposure controls limited'. It's 18°c...+It's a slightly warm day here in the UK (a whole 18°C), I've taken maybe 5 short video clips in the sun, and went to take a photo a minute or two later.I was met with a new warning - \"Device too hot exposure controls limited\"What fresh hell is this?What happens if we actually have good weather this summer?This phone, man...","18":"Are there any plans to make Gemini Live and\/or Screenshots available to people under 18?+I bought the P9P as my first phone, and I'm really enjoying the features it comes with. However, since I'm under 18, a handful of useful features such as Gemini Live, Screenshots, and Pixel Studio aren't available for my use.With the recent updates that have come following the S25 release, are there any plans to make these apps and features available to younger people like me?","19":"Problem with Pixel Studio on Pixel 9 Pro XL: 'To use Pixel Studio, you must be 18 or older'.+Edit - Resolved (worked around) by making a new google account. The new account lets me in with the same birthdate, but the old one still does not.Original Post:But my age is correct in the google account and it's many years beyond 18. As soon as I click 'Continue as ItsMopy' it presents me with this message on a blank screen, and a close app button, nothing else. Any thought on what I could change to get it let me access it?","20":"7 Years of Android Updates. Can Google & Samsung Really Deliver?+I’ve been thinking about Google and Samsung’s promise to support their latest phones for 7 years. On paper, it sounds great, but will the updates actually be useful, or will they just slow down devices like some claim Apple does? Most Android brands like OnePlus and Xiaomi barely offer 3-4 years, so this is a huge step. But will they actually keep it up long-term?","21":"Switching back to S23 Ultra after a week with the Oneplus 12+I got the Oneplus 12 because of its DC dimming and higher PWM at lower brightness, but after a week with it, I was itching to switch back to my S23 Ultra. Thoughts:Negatives:1) Nova Launcher doesn't work smoothly with gesture controls, there's a noticeable lag when I swipe to home. I thought it won't be a big deal, but couldn't stand it after a few days. 2) I miss the One Hand Application app for Samsung, that gave me a bunch of side of the screen gesture actions. I tried a few apps off the Google play store but I couldn't find one as reliable. 3) I miss the S pen, good for precise actions, remote camera triggers, and the occasional live sketch. 4a) I found the colors on the Samsung generally more accurate, with the Oneplus giving most photos a warmer tint than irl. Oneplus sometimes seem to have sharper images though, but that might be due to processing. Night photos and videos seem better on the Samsung. 4b) I also miss the 10x camera, which is great for travel and animal photography. 4c) No motion photos on the default oneplus camera app. I like the little snippets of video attached to each photo.5) One UI just feels more polished as an OS, more finalized and less improvised. 6) Samsung Pay turns NFC on and off automatically which seems more secure to me.  Positives1) The screen does feel slightly more comfortable on the OnePlus, so I might switch back to it if my eye strain comes back. I can see the flicker in the Samsung if I wave my fingers across the screen when it's dim.2) I can't seem to get true blacks in dark mode in a few apps on the Samsung, like Instapaper, while the Oneplus has it. 3) Screen off gestures are pretty convenient on the oneplus, especially the torch.4) The oneplus is lighter and less bulky. 5) The haptics are stronger and feel more satisfying on the oneplus. 6) Battery life seems longer and charging is faster. Anyone have thoughts that might make me change my mind again? ","22":"Oneplus 13 Megathread+[Live stream](https:\/\/www.youtube.com\/watch?v=QODMZuqbhhI)Reviews:[OnePlus 13 - Really The New Best Affordable Flagship? - TechTablets **pre global launch.**](https:\/\/www.youtube.com\/watch?v=oMUCm94CjjY)[OnePlus 13 vs. The World! Two Months Later... - Techmo **pre global launch?**](https:\/\/www.youtube.com\/watch?v=_gEvmud9EDI)[OnePlus 13 Review (Global Edition) - Tech Spurt](https:\/\/www.youtube.com\/watch?v=T6NWB6l8yiE)[OnePlus 13 Review: Lucky Number 13 JuanBagnell](https:\/\/www.youtube.com\/watch?v=KwVdAsbAMM4)[OnePlus 13 Review - Finally Back to their Roots! HowToMen](https:\/\/www.youtube.com\/watch?v=14HOTW9cjKA)[I Spent Almost A Month with the OnePlus 13 and Here's What I Discovered- TK Bay](https:\/\/www.youtube.com\/watch?v=rNmYjgm7AI4)[OnePlus 13 (Global) Review: The Most Complete OnePlus Phone Ever - ben's gadget reviews](https:\/\/www.youtube.com\/watch?v=zo48vAgBsA8)[OnePlus 13 Review: They Finally Did - Android Digest It](https:\/\/www.youtube.com\/watch?v=i_AyfCUVM_8)[OnePlus 13 Review: The Bar Has Been Set! - Marques Brownlee Set!](https:\/\/www.youtube.com\/watch?v=-kuG6RgL32c)[OnePlus 13 full review - GSMARENA](https:\/\/www.youtube.com\/watch?v=dJqK2lvrZNk&pp=ygUIZ3NtYXJlbmE%3D)[OnePlus 13 Review: The Best OnePlus Phone Ever! - Beebom](https:\/\/www.youtube.com\/watch?v=SFS_cZS-4iY)[The flagship killer has become the flagship - OnePlus 13 ShortCircuit](https:\/\/www.youtube.com\/watch?v=0fePd1BoqN4)[OnePlus 13 Review: Ship Shape? MrMobile (Michael Fisher)](https:\/\/www.youtube.com\/watch?v=bDJNd8XWJIU)[OnePlus 13 - The Comprehensive Review - Wildman Tech](https:\/\/www.youtube.com\/watch?v=Y0NtvXxwbwU)Camera review\/comparison:[Is Oneplus 13 Camera Good Enough for Professional Photography? - Through Jermaine's Lens **pre global launch**](https:\/\/www.youtube.com\/watch?v=rIwzDwe3jfg)[Oneplus 13 vs Oneplus 12 Camera Comparison! - Through Jermaine's Lens **pre global launch.**](https:\/\/www.youtube.com\/watch?v=ynLN-fU4a6Q)[Oneplus 12 vs Oneplus 13 LOW LIGHT Camera Comparison - Through Jermaine's Lens **pre global launch**](https:\/\/www.youtube.com\/watch?v=iCXGlVBLdyM)Articles:[REVIEW: The OnePlus 13 is a Super Reliable Phone that’s Never Gonna Let You Down - Mishaal Rahman](https:\/\/x.com\/MishaalRahman\/status\/1876668095156342887)[OnePlus 13 review: The best Android phone you can stick in a dishwasher - android central ](https:\/\/www.androidcentral.com\/phones\/oneplus-13-review)So I'm going to do something different for this mega thread. The OnePlus 13 already launched in China and some reviewers already made review\/content about it. I will also post those as well here, but I will organize them based on what those videos are. I will also denote the video pre global launch. As usual, if you guys find any videos that I miss, please let me know and I'll put them in the thread. Thanks!","23":"If you have switched from Apple or stayed with Android, tell me why? +I've been a long time android user, but given the rumors about the iPhone 17, I'm considering switching next year. So I'm looking for the reasons people didn't or don't switch over, or reasons why Apple users have switched to android. Thanks! ","24":"System apps that could be uninstalled without breaking any functionality in Samsung devices+I was trying to debloat my Samsung A14 5G device without root using [Canta](https:\/\/github.com\/samolego\/Canta) and [Shizuku](https:\/\/github.com\/RikkaApps\/Shizuku). While trying to find safe apps to remove, I couldn't find any articles online listing bloated apps in OneUI so made one myself, sort of.Listed below all the apps I could uninstall without harming any functionality of Android. I have been using this device for a week and I haven't found any break, in fact it's more responsive now. I tested for general use cases suiting to my use, it might or might not be enough for your Samsung device, but it can be a starting point.    1. com.android.chrome    2. com.aura.oobe.samsung    3. com.facebook.appmanager    4. com.facebook.services    5. com.facebook.system    6. com.google.android.apps.accessibility.voiceaccess    7. com.google.android.apps.restore    8. com.google.android.apps.tachyon    9. com.google.android.gm    10. com.google.android.healthconnect.controller    11. com.google.android.printservice.recommendation    12. com.google.android.projection.gearhead    13. com.microsoft.skydrive    14. com.mygalaxy    15. com.opera.max.oem    16. com.osp.app.signin    17. com.samsung.SMT    18. com.samsung.android.accessibility.talkback    19. com.samsung.android.alive.service    20. com.samsung.android.app.clockpack    21. com.samsung.android.app.contacts    22. com.samsung.android.app.omcagent    23. com.samsung.android.app.reminder    24. com.samsung.android.app.routines    25. com.samsung.android.app.sharelive    26. com.samsung.android.app.spage    27. com.samsung.android.app.updatecenter    28. com.samsung.android.app.watchmanagerstub    29. com.samsung.android.aremoji    30. com.samsung.android.aremojieditor    31. com.samsung.android.aware.service    32. com.samsung.android.calendar    33. com.samsung.android.easysetuP    34. com.samsung.android.fmm    35. com.samsung.android.game.gamehome    36. com.samsung.android.game.gametools    37. com.samsung.android.gru    38. com.samsung.android.ipsgeofence    39. com.samsung.android.kidsinstaller    40. com.samsung.android.mapsagent    41. com.samsung.android.mdecservice    42. com.samsung.android.mdx.kit    43. com.samsung.android.messaging    44. com.samsung.android.mfi    45. com.samsung.android.mobileservice    46. com.samsung.android.rubin.app    47. com.samsung.android.scloud    48. com.samsung.android.scpm    49. com.samsung.android.scs    50. com.samsung.android.smartcallprovider    51. com.samsung.android.spaymini    52. com.samsung.android.themecenter    53. com.samsung.android.themestore    54. com.samsung.android.uds    55. com.samsung.ecomm.global.in    56. com.samsung.gpuwatchapp    57. com.sec.android.app.SecSetupWizard    58. com.sec.android.app.billing    59. com.sec.android.app.clockpackage    60. com.sec.android.app.fm    61. com.sec.android.app.quicktool    62. com.sec.android.app.samsungapps    63. com.sec.android.daemonapp    64. com.sec.android.easyMover    65. com.sec.android.easyMover.Agent    66. com.sec.android.mimage.avatarstickers    67. com.sec.android.widgetapp.webmanual    68. com.sec.enterprise.knox.cloudmdm.smdms    69. com.sec.location.nsflp2Hope this is helpful.","25":"RCS is now running on iphones with IOS 18 beta+IOS 18 beta is now available to apple users which adds support for RCS messaging. Me and my friends now have a working group chat with replies, typing indicators, reactions, everything! I think it's only for certain carriers for the US possibly restricted to California. I will link the link in the comments my friend used to get the update, send it to your apple friends and enjoy the end of the blue bubbles debate! Edit: I am aware it doesn't change the color of the bubbles, but I think most iPhone users find that aspect dull in comparison to the actual functionality of the green messages (which was the problem)."}}