{"sentiment":{"0":"Neutral","1":"Neutral","2":"Neutral","3":"Neutral","4":"Neutral","5":"Neutral","6":"Neutral","7":"Neutral","8":"Neutral","9":"Neutral","10":"Neutral","11":"Neutral","12":"Neutral","13":"Neutral","14":"Neutral","15":"Neutral","16":"Neutral","17":"Neutral","18":"Neutral","19":"Neutral","20":"Neutral","21":"Neutral","22":"Neutral","23":"Neutral","24":"Neutral","25":"Neutral","26":"Neutral","27":"Neutral","28":"Neutral","29":"Neutral","30":"Neutral","31":"Neutral","32":"Neutral","33":"Neutral","34":"Neutral","35":"Neutral","36":"Neutral","37":"Neutral","38":"Neutral","39":"Neutral","40":"Neutral","41":"Neutral","42":"Neutral","43":"Neutral","44":"Neutral","45":"Neutral","46":"Neutral","47":"Neutral","48":"Neutral","49":"Neutral","50":"Neutral","51":"Neutral","52":"Neutral","53":"Neutral","54":"Neutral","55":"Neutral","56":"Neutral","57":"Neutral","58":"Neutral","59":"Neutral","60":"Neutral","61":"Neutral","62":"Neutral","63":"Neutral","64":"Neutral","65":"Neutral","66":"Neutral","67":"Neutral","68":"Neutral","69":"Neutral","70":"Neutral","71":"Neutral","72":"Neutral","73":"Neutral","74":"Neutral","75":"Neutral","76":"Neutral","77":"Neutral","78":"Neutral","79":"Neutral","80":"Neutral","81":"Neutral","82":"Neutral","83":"Neutral","84":"Neutral","85":"Neutral","86":"Neutral","87":"Neutral","88":"Neutral","89":"Neutral","90":"Neutral","91":"Neutral","92":"Neutral","93":"Neutral","94":"Neutral","95":"Neutral","96":"Neutral","97":"Neutral","98":"Neutral","99":"Neutral","100":"Neutral","101":"Neutral","102":"Neutral","103":"Neutral","104":"Neutral","105":"Neutral","106":"Neutral","107":"Neutral","108":"Neutral","109":"Neutral","110":"Neutral","111":"Neutral","112":"Neutral","113":"Neutral","114":"Neutral","115":"Neutral","116":"Neutral","117":"Neutral","118":"Neutral","119":"Neutral","120":"Neutral","121":"Neutral","122":"Neutral","123":"Neutral"},"user_review":{"0":"Google announces early August 13 event for Pixel 9 and Pixel Watch 3+","1":"Pixel Watch 3 review: Google finally got it right, especially with the battery life+","2":"Pixel Watch 3 leak reveals 24 hours of battery life+","3":"Pixel 9 lineup still uses UFS 3.1+source: me, ran CPDT benchmark Pixel 9 Pro\/XL: https:\/\/imgur.com\/a\/AfEmmp3Galaxy Z Flip6: https:\/\/imgur.com\/a\/lqpH3gB256GB on both.","4":"Exclusive: Google Cancels Pixel Tablet 3 Development+","5":"Pixel Watch 3 specs leak: Same chip, RAM, and storage, 1-60Hz refresh rate+","6":"Loss of Pulse Detection on Pixel Watch 3 receives FDA clearance+","7":"Sources: Pixel Watch 3 will have 45mm size, Pixel Buds Pro 2 also coming+","8":"Pixel watch 3 pricing: up to $500+* Leaked pricing suggests the Pixel Watch 3 will start at $349 for WiFi and $449 for the LTE model.* The larger Pixel Watch 3 XL is expected to be priced at $399 for WiFi and $499 for LTE.* While the WiFi-only Pixel Watch 3 maintains the same price as its predecessor, the LTE model sees a $50 increase.https:\/\/www.androidauthority.com\/pixel-watch-3-price-leak-3467128\/","9":"Exclusive: This is the Google Pixel 9 Pro in All 4 Colors+","10":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","11":"Pixel 6 bricked after enabling private space feature in Android 15+Just giving a PSA to anyone who has a pixel 6. Don't enable the private space feature if you upgrade to Android 15. I unlocked the private space area, opened an app I installed in it, and it bricked my Pixel 6. I can't turn the phone on or reboot it using the methods provided by Google. It's completely dead.I'm not sure if I was just unlucky or if this is a wider spread issue with Pixel 6 devices, but I'm now going to have to buy a brand new Pixel as the phone is basically a paper weight now.","12":"June Feature Drop: Pixel 8 Display Port mirroring, 6\/7 Pro Manual Lens Selection, PW2 Car Crash Detection+","13":"Live Scam Detection in calls rolling out to Pixel 6-9 Phone app+","14":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","15":"June Feature Drop: Pixel 8 Display Port mirroring, 6\/7 Pro Manual Lens Selection, PW2 Car Crash Detection+","16":"Poll: Would you buy the Pixel 10 if it had free unlimited photo backups?+","17":"Exclusive: Google picks a MediaTek modem for the Pixel 10 series+","18":"Exclusive: Huge Pixel 10 and 11 leak reveals Google Tensor is following in the iPhone's footsteps+","19":"Google Pixel 10: First phone case leak provides an early look at the design+","20":"Full Tensor G5 specs reveal big and small changes coming to the Pixel 10+","21":"I am buying a used pixel 7 in another 12 hours.What are the things i should check\/look for?+Title.Buying a P7 in Srilanka.Any other tips\/advices also will be very much appreciated ","22":"Streaming HD video over wifi the Pixel 9 Pro lasts 17:25hrs, Pixel 9 Pro XL 12:24hrs, and Pixel 9 lasts 11:45hrs.+","23":"Google announces early August 13 event for Pixel 9 and Pixel Watch 3+","24":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","25":"Streaming HD video over wifi the Pixel 9 Pro lasts 17:25hrs, Pixel 9 Pro XL 12:24hrs, and Pixel 9 lasts 11:45hrs.+","26":"Weekly #TeamPixel Photos Megathread October 17 2024+This is the weekly photo Megathread. Photos captured with your Pixel (or other Google devices) posted outside of this thread are not allowed. Also, please mention the device you took the photo with. For more pictures, check out r\/pixelography.**\\#TeamPixel***An archive of past photo Megathreads can be [found here](https:\/\/www.reddit.com\/r\/GooglePixel\/wiki\/photos).**To return to the Superthread, [click here](https:\/\/reddit.com\/r\/GooglePixel\/about\/sticky?num=2).*","27":"Google Pixel Fold (Original) - Review after 17 months of use+I was very excited to purchase this phone back in June 2023. The pros are obvious and stated by other users here as well as on CNET, Wired, CNET, etc. On the flip side, the phone has fallen victim to the same fallacy affecting other first-generation novelties - focusing on the breakthrough feature but sacrificing both basic features associated with a smartphone. Moreover, the Fold (even when compared to the Galaxy) is quite rudimentary and lfalls short with heuristics that define the user experience interacting with a table-type phone.* Battery - Terrible as always. I’ve never had a Pixel phone where I didn’t have the battery saver on by defaults nd it still dies within 3\/4 of my day without charge* No good case - Even , the front portion of the case easily loses its adhesiveness around the 2-3 mm border. This is more of an issue with the case, but the design of the phone itself does not allow for an appropriate case for the front panel* Front panel - Very difficult to backwards swipe to go to a previous web page when viewing in a broswer- will usually just translate to the next Home Screen panel * Fold display - this clearly a first draft and I wish I had waited for the third. So many issues:   * Screen takes 2-3 seconds to “turn on” when unfolding the phone   * Google tries very hard to describe the two panel feature, but it is FAR from self-explanatory. Moreover, even basic apps from Google do not function properly, with many text-entry app functions missing the keyboard for swipe or text (forcing me to fold the phone to the single display to have the keyboard pop up)   * Several apps will take up 1.t5 screens   * They keyboard, when it appears, has a humungous gap in the keyboard between the panels, making swype inefficient and unusable* Incompatibility between Gmail and Dropbox - this apparently is an issue for all Google \/ Android phones* Ongoing Android\/iPhone MMS disconnect - leading to granular video appearing when Apple and Android users are together on MMS* Unlocked phones have data reconnecrtivity issues after switching to Wi-Fi for calling (no signal) but then having an issue with the Wi-Fi at the location itself. After a couple hours, once you leave the dead zone area and return to 5G\/LTE areas, the phone can take hours to reconnect to Verizon. Even with toggling Airplane mode, SIM card, and multiple restarts* Awkward tapping of the rear horizontal camera panel to take a screenshot - absolutely inconsistent and clumsy * Significant lag in accessing text messages especially when you have multiple years of conversations stored)* Camera quality IMHO took a hit compared to Pixel 6 and predecessors* Verizon general signal issues.","28":"Android 15 vs iOS 18 +","29":"Wtf? Apple in Talks to License Google Gemini for iPhone, iOS 18 Generative AI Tools - Bloomberg+","30":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","31":"Beware of Android 15 and iOS 18 updates if using Dexcom and Stelo diabetes management apps\n+[https:\/\/techissuestoday.com\/dexcom-and-stelo-apps-compatibility-android-15-and-ios-18\/](https:\/\/techissuestoday.com\/dexcom-and-stelo-apps-compatibility-android-15-and-ios-18\/)","32":"Samsung temporarily halts Galaxy Buds 3 Pro sales, says sorry for quality issues+","33":"CMF by Nothing: CMF Phone 1 makes record breaking sales of 100,000 units in just 3 hours.+","34":"Exclusive: Google Cancels Pixel Tablet 3 Development+","35":"Tensor G4 vs Snapdragon 8 Gen 3: Benchmark & Specs Comparison+","36":"Loss of Pulse Detection has received U.S. FDA clearance, and is now available on Pixel Watch 3.+","37":"Samsung's Second-Gen 3 nm GAA Process Shows 20% Yields, Missing Production Goals+","38":"\"mini\" now means 6.3\" - vivo X200 Pro mini+","39":"Google Wallet will let you make digital IDs with US passports, 3 more state IDs coming +","40":"qBitController is a free and open-source app for controlling qBittorrent - a popular torrent client, from an Android device. It has just reached the 1.0.0 milestone and has added features like Material Design 3\/You support, adding multiple torrents at a time, and several fixes.+","41":"This is Microsoft's canceled Surface Duo 3 foldable smartphone+","42":"Snapdragon 8 Gen 4 in the OnePlus 13 appears on Geekbench and flexes wicked CPU clock speeds+","43":"Samsung Galaxy S24 Ultra runs Fallout 4 and many other PC games with more than playable frame rates+","44":"Adreno 830: Snapdragon 8 Gen 4 GPU rumoured to be 57% faster than last-gen counterpart+","45":"Report claims the Snapdragon 8 Gen 4 might require larger batteries+","46":"First Snapdragon 8 gen 4 spotted on Geekbench+","47":"Samsung's Galaxy A55 and A35 are official with 6.4\" OLED screens, focus on security+","48":"Pixel 11 could bring back a very useful feature from the Pixel 4+","49":"Exclusive: Google Pixel 8a Leaks in all 4 colors+","50":"Play Store now allows updating tons of app simultaneously (not just 3 or 4)+","51":"Galaxy S25’s Exynos 2500 to be more efficient than Snapdragon 8 Gen 4+","52":"Report: Samsung using new battery tech in Galaxy S26 with ‘monster’ capacity over 6,000 mAh+","53":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","54":"33,000mAh battery runs fat smartphone for over 6 months on 1 charge+","55":"The first cheap Samsung phone to get 6 years of Android updates is here \/ The Galaxy A16 5G is the first Samsung device in its category to promise six generations of Android updates and six years of security patches.+","56":"9 years ago on this day, Android Lollipop was released. Nexus 6 also released in November and was amongst the first to receive Android 5.0.+","57":"Android 15 update is bricking some Pixel 6 devices+","58":"Walmart releases $50 Onn 4K Pro streamer w\/ 32GB Storage, 3GB RAM, WiFi 6, hands-free voice control, and more+","59":"Galaxy A26, A36, A56: Samsung plans 6x Android, 6 years of updates+","60":"The OnePlus 13 might include a massive 6,000mAh battery, but it comes at a cost [no wireless charging]+","61":"ASUS is launching the Zenfone 12 Ultra on February 6+","62":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","63":"Exclusive: This is the Samsung Galaxy Z Fold 7+","64":"Samsung is redesigning Good Lock with One UI 7 alongside global Play Store release+","65":"One UI 7 lets you stop HDR photos from making your screen super bright+","66":"Samsung confirms One UI 7 rollout for all Galaxy S series phones+","67":"Exclusive: Samsung One UI 7 First Look and Key Features Revealed+","68":"Google Authenticator 7.0 rolls out Material You redesign, search, & more+","69":"Ice Universe: Galaxy S25 Ultra camera specifications have been confirmed. The only upgrade is the ultra-wide-angle sensor, 50MP 0.7um ISOCELL JN3 sensor, the main camera 200MP HP2 (small process upgrade model unchanged), 3x is still 10MP IMX754, 5x is still IMX854 50MP 0.7 um+","70":"Exclusive: Google picks a MediaTek modem for the Pixel 10 series+","71":"HTC One M8: The Android GOAT, 10 Years On!+","72":"Exclusive: Huge Pixel 10 and 11 leak reveals Google Tensor is following in the iPhone's footsteps+","73":"Google Pixel 9 successor: First proof of a \"Samsung-free\" Tensor G5 chip in the Pixel 10+","74":"10 updates coming to the Android ecosystem+","75":"Google Tensor G5: Pixel 10 series' SoC allegedly tapes out on TSMC's 3 nm node+","76":"Full Tensor G5 specs reveal big and small changes coming to the Pixel 10+","77":"Pixel 9 Pro XL is one of the top 10 premium phones in the US+","78":"Monument Valley at 10: the story of the most meticulous puzzle game ever created+","79":"The RedMagic 10 Pro Plus is basically a power bank attached to a gaming phone+","80":"HTC is teasing a new phone! To be revealed June 12.+","81":"ASUS is launching the Zenfone 12 Ultra on February 6+","82":"OnePlus 12 5G Smartphone Review: Near-Galaxy S24 Ultra flagship experience for half the price+","83":"ASUS Announces Zenfone 12 Ultra - ASUS Pressrooom+","84":"Qualcomm releases Snapdragon 6 Gen 4 - x1 Cortex-A720 Prime core at 2.3 Ghz, 3x Cortex-A720 performance cores at 2.2 GHz, 4x Cortex-A520 efficiency cores at 1.8 GHz - supposes to offer 11% improvement in CPU performance, 29% improvement in GPU performance, and 12% improvement in battery life+","85":"Asus Zenfone 12 Ultra: this is the new top smartphone+","86":"Asus Zenfone 12 Ultra review+","87":"Asus Zenfone 12 Ultra launches with Snapdragon 8 Elite, improved gimbal stabilization -GSMArena+","88":"Redmi Pad Pro debuts with 12.1” IPS LCD (1600p 120Hz) and SD 7s Gen 2 (from ¥1499\/$207)+","89":"OnePlus 13 Smartphone Review: Let the battery revolution begin+","90":"Ahead of Android 15's launch, Android 14 is on at least 13% of active devices+","91":"Snapdragon 8 Gen 4 in the OnePlus 13 appears on Geekbench and flexes wicked CPU clock speeds+","92":"S25 Ultra vs OnePlus 13 - Samsung has no Excuse! (Heavy Workload Test)+","93":"The OnePlus 13 might include a massive 6,000mAh battery, but it comes at a cost [no wireless charging]+","94":"It's official: The OnePlus 13 is coming and will launch very soon+","95":"OnePlus 13 arrives with Snapdragon 8 Elite and 6,000 mAh battery+","96":"New OnePlus 13 Mini leak contradicts previous camera rumors+","97":"[GSMArena] iQOO 13 Review+","98":"Google is preparing a major overhaul to notifications and Quick Settings in Android 16+","99":"Google may redesign the volume UI in Android 16, and here's a first look+","100":"Android 16 Beta 2 lets you double press the power button to open Google Wallet+","101":"Android 16 could let apps show Dynamic Island-like notifications+","102":"Here's your first real look at Live Updates in Android 16+","103":"Android 16 could turn Wi-Fi and Bluetooth into one-click toggles once again+","104":"Android 16 Beta 2 forces apps to go edge-to-edge and enhances Ultra HDR+","105":"Google may let you resize Quick Settings tiles in Android 16+","106":"Android 16 DP2 lets you use your Pixel's Fingerprint Unlock even when the screen is off+","107":"Google confirms Android 16 is coming earlier than usual, developer preview begins soon+","108":"A slimmer Galaxy S25 could rival iPhone 17 Slim+","109":"Google Find My Device network might launch soon as iOS 17.5 preps tracking alerts+","110":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","111":"Android turns 17: From beta to global dominance+","112":"Microsoft is ending support for Windows Subsystem for Android+","113":"Google is preparing a major overhaul to notifications and Quick Settings in Android 16+","114":"evleaks: Sony Xperia 1 VI marketing material+","115":"Here’s a look at Priority Modes in Android 16, a better version of Do Not Disturb+","116":"Apple will support RCS with iOS 18, improving messaging experience between iPhone and Android+","117":"Snapdragon 8s Gen 3: Qualcomm confirms March 18 launch event for new \"Snapdragon flagship\" chipset+","118":"PSA: iOS 18’s RCS support will show all users in a group text if you change the name of the group on your Android phone now +I’m an iPhone user but have a few group texts with Android users. My father in law changed the name of the one he is in on his phone and didn’t know it would change on all of ours as well because it never has before lolLuckily it was just a normal name but I can see this being an issue for some people.","119":"Pebble cements its smartwatch legacy as Google shares source code with the community+","120":"Google officially confirms the Pixel 6 series, Pixel 7 series, and Pixel Fold will get an additional 2 years of OS updates+The company has [updated a support page](https:\/\/support.google.com\/pixelphone\/answer\/4457705?hl=en#zippy=%2Cpixel-pixel-pro-pixel-pro-xl-pixel-pro-fold%2Cpixel-a-pixel-pixel-pro%2Cpixel-a-pixel-pixel-pro-pixel-a-pixel-pixel-pro-pixel-fold%2Cpixel-a-g-pixel-pixel-a-g-pixel-a-pixel-xl-pixel) to mention that these Pixel phones are guaranteed 5 years of updates - including 5 years of OS and security updates - starting from when they went on sale.This means the Pixel 6 series will get updates to Android 16 and Android 17, while the Pixel 7 series and Pixel Fold will get updates to Android 17 and Android 18.H\/T Nail Sadykov","121":"Google is preparing to bring this iOS 18 feature (Vehicle Motion Cues) to Android (APK teardown)+","122":"India Smartphone Market Volume up 8% YoY, Value up 18% YoY in Q1 2024; vivo Leads in Volume, Samsung in Value+","123":"Sunsetting LineageOS 18.1+"}}